main.wasm:	file format WASM

.debug_info contents:
0x00000000: Compile Unit: length = 0x00001ed8, format = DWARF32, version = 0x0004, abbr_offset = 0x0000, addr_size = 0x04 (next unit at 0x00001edc)

0x0000000b: DW_TAG_compile_unit
              DW_AT_producer	("zig 0.11.0")
              DW_AT_language	(DW_LANG_C99)
              DW_AT_name	("main")
              DW_AT_stmt_list	(0x00000000)
              DW_AT_comp_dir	("/Users/antoine/prog/zig-playground/6-canvas")
              DW_AT_GNU_pubnames	(true)
              DW_AT_low_pc	(0x00000000)
              DW_AT_ranges	(0x00000090
                 [0x00000003, 0x00000294)
                 [0x00000296, 0x00000436)
                 [0x00000437, 0x0000048e)
                 [0x00000490, 0x00000784)
                 [0x00000785, 0x000007fa)
                 [0x000007fb, 0x00000809)
                 [0x0000080a, 0x0000086e)
                 [0x00000870, 0x000008f0)
                 [0x000008f2, 0x00000972)
                 [0x00000974, 0x00000b66)
                 [0x00000b67, 0x00000ba1)
                 [0x00000ba3, 0x00000e16)
                 [0x00000e18, 0x0000108b)
                 [0x0000108d, 0x00001295)
                 [0x00001297, 0x0000149f)
                 [0x0000153e, 0x00001779)
                 [0x00001ae8, 0x00001d49)
                 [0x00001d4a, 0x00001db5)
                 [0x000014a0, 0x000014fa)
                 [0x000014fb, 0x0000153c)
                 [0x0000177b, 0x000018a9)
                 [0x000018ab, 0x00001ae6)
                 [0x00001db6, 0x00001e35)
                 [0x00002364, 0x0000259e)
                 [0x000025a0, 0x00002c66)
                 [0x00002c67, 0x00002caa)
                 [0x00002cac, 0x00002e45)
                 [0x00004257, 0x000049df)
                 [0x000049e1, 0x00004ca5)
                 [0x00004ca7, 0x00005507)
                 [0x00005509, 0x00005593)
                 [0x00005594, 0x000055d0)
                 [0x000055d2, 0x00005671)
                 [0x00005673, 0x00005949)
                 [0x0000594a, 0x000059a7)
                 [0x00001e36, 0x00001e80)
                 [0x00001e82, 0x00002362)
                 [0x00002e47, 0x00003226)
                 [0x00003228, 0x00003949)
                 [0x0000394b, 0x00004255))

0x00000026:   DW_TAG_variable
                DW_AT_name	("zig_backend")
                DW_AT_type	(0x00000035 "builtin.CompilerBackend")
                DW_AT_decl_file	("/Users/antoine/.cache/zig/o/696ab8ea543c9d1c252fa3dc6efbb2c8/builtin.zig")
                DW_AT_decl_line	(6)
                DW_AT_linkage_name	("builtin.zig_backend")

0x00000035:   DW_TAG_enumeration_type
                DW_AT_type	(0x0000008c "u64")
                DW_AT_name	("builtin.CompilerBackend")
                DW_AT_byte_size	(0x08)
                DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/builtin.zig")
                DW_AT_decl_line	(960)
                DW_AT_alignment	(8)

0x00000043:     DW_TAG_enumerator
                  DW_AT_name	("other")
                  DW_AT_const_value	(0)

0x00000049:     DW_TAG_enumerator
                  DW_AT_name	("stage1")
                  DW_AT_const_value	(1)

0x0000004f:     DW_TAG_enumerator
                  DW_AT_name	("stage2_llvm")
                  DW_AT_const_value	(2)

0x00000055:     DW_TAG_enumerator
                  DW_AT_name	("stage2_c")
                  DW_AT_const_value	(3)

0x0000005b:     DW_TAG_enumerator
                  DW_AT_name	("stage2_wasm")
                  DW_AT_const_value	(4)

0x00000061:     DW_TAG_enumerator
                  DW_AT_name	("stage2_arm")
                  DW_AT_const_value	(5)

0x00000067:     DW_TAG_enumerator
                  DW_AT_name	("stage2_x86_64")
                  DW_AT_const_value	(6)

0x0000006d:     DW_TAG_enumerator
                  DW_AT_name	("stage2_aarch64")
                  DW_AT_const_value	(7)

0x00000073:     DW_TAG_enumerator
                  DW_AT_name	("stage2_x86")
                  DW_AT_const_value	(8)

0x00000079:     DW_TAG_enumerator
                  DW_AT_name	("stage2_riscv64")
                  DW_AT_const_value	(9)

0x0000007f:     DW_TAG_enumerator
                  DW_AT_name	("stage2_sparc64")
                  DW_AT_const_value	(10)

0x00000085:     DW_TAG_enumerator
                  DW_AT_name	("stage2_spirv64")
                  DW_AT_const_value	(11)

0x0000008b:     NULL

0x0000008c:   DW_TAG_base_type
                DW_AT_name	("u64")
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_byte_size	(0x08)

0x00000093:   DW_TAG_variable
                DW_AT_name	("empty")
                DW_AT_type	(0x000000a3 "target.Target.Cpu.Feature.Set")
                DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/target.zig")
                DW_AT_decl_line	(701)
                DW_AT_linkage_name	("target.Target.Cpu.Feature.Set.empty")

0x000000a3:   DW_TAG_structure_type
                DW_AT_name	("target.Target.Cpu.Feature.Set")
                DW_AT_byte_size	(0x24)
                DW_AT_alignment	(4)

0x000000aa:     DW_TAG_member
                  DW_AT_name	("ints")
                  DW_AT_type	(0x000000b6 "usize[9]")
                  DW_AT_alignment	(4)
                  DW_AT_data_member_location	(0x00)

0x000000b5:     NULL

0x000000b6:   DW_TAG_array_type
                DW_AT_type	(0x000000c2 "usize")

0x000000bb:     DW_TAG_subrange_type
                  DW_AT_type	(0x000000c9 "__ARRAY_SIZE_TYPE__")
                  DW_AT_count	(0x09)

0x000000c1:     NULL

0x000000c2:   DW_TAG_base_type
                DW_AT_name	("usize")
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_byte_size	(0x04)

0x000000c9:   DW_TAG_base_type
                DW_AT_name	("__ARRAY_SIZE_TYPE__")
                DW_AT_byte_size	(0x08)
                DW_AT_encoding	(DW_ATE_unsigned)

0x000000d0:   DW_TAG_variable
                DW_AT_name	("generic")
                DW_AT_type	(0x000000df "target.Target.Cpu.Model")
                DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/target/wasm.zig")
                DW_AT_decl_line	(113)
                DW_AT_linkage_name	("target.wasm.cpu.generic")

0x000000df:   DW_TAG_structure_type
                DW_AT_name	("target.Target.Cpu.Model")
                DW_AT_byte_size	(0x34)
                DW_AT_alignment	(4)

0x000000e6:     DW_TAG_member
                  DW_AT_name	("name")
                  DW_AT_type	(0x00000108 "[]u8")
                  DW_AT_alignment	(4)
                  DW_AT_data_member_location	(0x00)

0x000000f1:     DW_TAG_member
                  DW_AT_name	("llvm_name")
                  DW_AT_type	(0x00000108 "[]u8")
                  DW_AT_alignment	(4)
                  DW_AT_data_member_location	(0x08)

0x000000fc:     DW_TAG_member
                  DW_AT_name	("features")
                  DW_AT_type	(0x000000a3 "target.Target.Cpu.Feature.Set")
                  DW_AT_alignment	(4)
                  DW_AT_data_member_location	(0x10)

0x00000107:     NULL

0x00000108:   DW_TAG_structure_type
                DW_AT_name	("[]u8")
                DW_AT_byte_size	(0x08)
                DW_AT_alignment	(4)

0x0000010f:     DW_TAG_member
                  DW_AT_name	("ptr")
                  DW_AT_type	(0x00000126 "u8 *")
                  DW_AT_alignment	(4)
                  DW_AT_data_member_location	(0x00)

0x0000011a:     DW_TAG_member
                  DW_AT_name	("len")
                  DW_AT_type	(0x000000c2 "usize")
                  DW_AT_alignment	(4)
                  DW_AT_data_member_location	(0x04)

0x00000125:     NULL

0x00000126:   DW_TAG_pointer_type
                DW_AT_type	(0x0000012f "u8")
                DW_AT_name	("*u8")

0x0000012f:   DW_TAG_base_type
                DW_AT_name	("u8")
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_byte_size	(0x01)

0x00000136:   DW_TAG_variable
                DW_AT_name	("cpu")
                DW_AT_type	(0x00000145 "target.Target.Cpu")
                DW_AT_decl_file	("/Users/antoine/.cache/zig/o/696ab8ea543c9d1c252fa3dc6efbb2c8/builtin.zig")
                DW_AT_decl_line	(13)
                DW_AT_linkage_name	("builtin.cpu")

0x00000145:   DW_TAG_structure_type
                DW_AT_name	("target.Target.Cpu")
                DW_AT_byte_size	(0x2c)
                DW_AT_alignment	(4)

0x0000014c:     DW_TAG_member
                  DW_AT_name	("model")
                  DW_AT_type	(0x000002eb "target.Target.Cpu.Model *")
                  DW_AT_alignment	(4)
                  DW_AT_data_member_location	(0x00)

0x00000157:     DW_TAG_member
                  DW_AT_name	("features")
                  DW_AT_type	(0x000000a3 "target.Target.Cpu.Feature.Set")
                  DW_AT_alignment	(4)
                  DW_AT_data_member_location	(0x04)

0x00000162:     DW_TAG_member
                  DW_AT_name	("arch")
                  DW_AT_type	(0x0000016d "target.Target.Cpu::target.Target.Cpu.Arch")
                  DW_AT_alignment	(1)
                  DW_AT_data_member_location	(0x28)

0x0000016d:     DW_TAG_enumeration_type
                  DW_AT_type	(0x000002f4 "u6")
                  DW_AT_name	("target.Target.Cpu.Arch")
                  DW_AT_byte_size	(0x01)
                  DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/target.zig")
                  DW_AT_decl_line	(3040)
                  DW_AT_alignment	(1)

0x0000017b:       DW_TAG_enumerator
                    DW_AT_name	("arm")
                    DW_AT_const_value	(0)

0x00000181:       DW_TAG_enumerator
                    DW_AT_name	("armeb")
                    DW_AT_const_value	(1)

0x00000187:       DW_TAG_enumerator
                    DW_AT_name	("aarch64")
                    DW_AT_const_value	(2)

0x0000018d:       DW_TAG_enumerator
                    DW_AT_name	("aarch64_be")
                    DW_AT_const_value	(3)

0x00000193:       DW_TAG_enumerator
                    DW_AT_name	("aarch64_32")
                    DW_AT_const_value	(4)

0x00000199:       DW_TAG_enumerator
                    DW_AT_name	("arc")
                    DW_AT_const_value	(5)

0x0000019f:       DW_TAG_enumerator
                    DW_AT_name	("avr")
                    DW_AT_const_value	(6)

0x000001a5:       DW_TAG_enumerator
                    DW_AT_name	("bpfel")
                    DW_AT_const_value	(7)

0x000001ab:       DW_TAG_enumerator
                    DW_AT_name	("bpfeb")
                    DW_AT_const_value	(8)

0x000001b1:       DW_TAG_enumerator
                    DW_AT_name	("csky")
                    DW_AT_const_value	(9)

0x000001b7:       DW_TAG_enumerator
                    DW_AT_name	("dxil")
                    DW_AT_const_value	(10)

0x000001bd:       DW_TAG_enumerator
                    DW_AT_name	("hexagon")
                    DW_AT_const_value	(11)

0x000001c3:       DW_TAG_enumerator
                    DW_AT_name	("loongarch32")
                    DW_AT_const_value	(12)

0x000001c9:       DW_TAG_enumerator
                    DW_AT_name	("loongarch64")
                    DW_AT_const_value	(13)

0x000001cf:       DW_TAG_enumerator
                    DW_AT_name	("m68k")
                    DW_AT_const_value	(14)

0x000001d5:       DW_TAG_enumerator
                    DW_AT_name	("mips")
                    DW_AT_const_value	(15)

0x000001db:       DW_TAG_enumerator
                    DW_AT_name	("mipsel")
                    DW_AT_const_value	(16)

0x000001e1:       DW_TAG_enumerator
                    DW_AT_name	("mips64")
                    DW_AT_const_value	(17)

0x000001e7:       DW_TAG_enumerator
                    DW_AT_name	("mips64el")
                    DW_AT_const_value	(18)

0x000001ed:       DW_TAG_enumerator
                    DW_AT_name	("msp430")
                    DW_AT_const_value	(19)

0x000001f3:       DW_TAG_enumerator
                    DW_AT_name	("powerpc")
                    DW_AT_const_value	(20)

0x000001f9:       DW_TAG_enumerator
                    DW_AT_name	("powerpcle")
                    DW_AT_const_value	(21)

0x000001ff:       DW_TAG_enumerator
                    DW_AT_name	("powerpc64")
                    DW_AT_const_value	(22)

0x00000205:       DW_TAG_enumerator
                    DW_AT_name	("powerpc64le")
                    DW_AT_const_value	(23)

0x0000020b:       DW_TAG_enumerator
                    DW_AT_name	("r600")
                    DW_AT_const_value	(24)

0x00000211:       DW_TAG_enumerator
                    DW_AT_name	("amdgcn")
                    DW_AT_const_value	(25)

0x00000217:       DW_TAG_enumerator
                    DW_AT_name	("riscv32")
                    DW_AT_const_value	(26)

0x0000021d:       DW_TAG_enumerator
                    DW_AT_name	("riscv64")
                    DW_AT_const_value	(27)

0x00000223:       DW_TAG_enumerator
                    DW_AT_name	("sparc")
                    DW_AT_const_value	(28)

0x00000229:       DW_TAG_enumerator
                    DW_AT_name	("sparc64")
                    DW_AT_const_value	(29)

0x0000022f:       DW_TAG_enumerator
                    DW_AT_name	("sparcel")
                    DW_AT_const_value	(30)

0x00000235:       DW_TAG_enumerator
                    DW_AT_name	("s390x")
                    DW_AT_const_value	(31)

0x0000023b:       DW_TAG_enumerator
                    DW_AT_name	("tce")
                    DW_AT_const_value	(32)

0x00000241:       DW_TAG_enumerator
                    DW_AT_name	("tcele")
                    DW_AT_const_value	(33)

0x00000247:       DW_TAG_enumerator
                    DW_AT_name	("thumb")
                    DW_AT_const_value	(34)

0x0000024d:       DW_TAG_enumerator
                    DW_AT_name	("thumbeb")
                    DW_AT_const_value	(35)

0x00000253:       DW_TAG_enumerator
                    DW_AT_name	("x86")
                    DW_AT_const_value	(36)

0x00000259:       DW_TAG_enumerator
                    DW_AT_name	("x86_64")
                    DW_AT_const_value	(37)

0x0000025f:       DW_TAG_enumerator
                    DW_AT_name	("xcore")
                    DW_AT_const_value	(38)

0x00000265:       DW_TAG_enumerator
                    DW_AT_name	("xtensa")
                    DW_AT_const_value	(39)

0x0000026b:       DW_TAG_enumerator
                    DW_AT_name	("nvptx")
                    DW_AT_const_value	(40)

0x00000271:       DW_TAG_enumerator
                    DW_AT_name	("nvptx64")
                    DW_AT_const_value	(41)

0x00000277:       DW_TAG_enumerator
                    DW_AT_name	("le32")
                    DW_AT_const_value	(42)

0x0000027d:       DW_TAG_enumerator
                    DW_AT_name	("le64")
                    DW_AT_const_value	(43)

0x00000283:       DW_TAG_enumerator
                    DW_AT_name	("amdil")
                    DW_AT_const_value	(44)

0x00000289:       DW_TAG_enumerator
                    DW_AT_name	("amdil64")
                    DW_AT_const_value	(45)

0x0000028f:       DW_TAG_enumerator
                    DW_AT_name	("hsail")
                    DW_AT_const_value	(46)

0x00000295:       DW_TAG_enumerator
                    DW_AT_name	("hsail64")
                    DW_AT_const_value	(47)

0x0000029b:       DW_TAG_enumerator
                    DW_AT_name	("spir")
                    DW_AT_const_value	(48)

0x000002a1:       DW_TAG_enumerator
                    DW_AT_name	("spir64")
                    DW_AT_const_value	(49)

0x000002a7:       DW_TAG_enumerator
                    DW_AT_name	("spirv32")
                    DW_AT_const_value	(50)

0x000002ad:       DW_TAG_enumerator
                    DW_AT_name	("spirv64")
                    DW_AT_const_value	(51)

0x000002b3:       DW_TAG_enumerator
                    DW_AT_name	("kalimba")
                    DW_AT_const_value	(52)

0x000002b9:       DW_TAG_enumerator
                    DW_AT_name	("shave")
                    DW_AT_const_value	(53)

0x000002bf:       DW_TAG_enumerator
                    DW_AT_name	("lanai")
                    DW_AT_const_value	(54)

0x000002c5:       DW_TAG_enumerator
                    DW_AT_name	("wasm32")
                    DW_AT_const_value	(55)

0x000002cb:       DW_TAG_enumerator
                    DW_AT_name	("wasm64")
                    DW_AT_const_value	(56)

0x000002d1:       DW_TAG_enumerator
                    DW_AT_name	("renderscript32")
                    DW_AT_const_value	(57)

0x000002d7:       DW_TAG_enumerator
                    DW_AT_name	("renderscript64")
                    DW_AT_const_value	(58)

0x000002dd:       DW_TAG_enumerator
                    DW_AT_name	("ve")
                    DW_AT_const_value	(59)

0x000002e3:       DW_TAG_enumerator
                    DW_AT_name	("spu_2")
                    DW_AT_const_value	(60)

0x000002e9:       NULL

0x000002ea:     NULL

0x000002eb:   DW_TAG_pointer_type
                DW_AT_type	(0x000000df "target.Target.Cpu.Model")
                DW_AT_name	("*target.Target.Cpu.Model")

0x000002f4:   DW_TAG_base_type
                DW_AT_name	("u6")
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_byte_size	(0x01)

0x000002fb:   DW_TAG_variable
                DW_AT_name	("simplified_logic")
                DW_AT_type	(0x0000030a "bool")
                DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/start.zig")
                DW_AT_decl_line	(19)
                DW_AT_linkage_name	("start.simplified_logic")

0x0000030a:   DW_TAG_base_type
                DW_AT_name	("bool")
                DW_AT_encoding	(DW_ATE_boolean)
                DW_AT_byte_size	(0x01)

0x00000311:   DW_TAG_variable
                DW_AT_name	("output_mode")
                DW_AT_type	(0x00000320 "builtin.OutputMode")
                DW_AT_decl_file	("/Users/antoine/.cache/zig/o/696ab8ea543c9d1c252fa3dc6efbb2c8/builtin.zig")
                DW_AT_decl_line	(8)
                DW_AT_linkage_name	("builtin.output_mode")

0x00000320:   DW_TAG_enumeration_type
                DW_AT_type	(0x00000341 "u2")
                DW_AT_name	("builtin.OutputMode")
                DW_AT_byte_size	(0x01)
                DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/builtin.zig")
                DW_AT_decl_line	(631)
                DW_AT_alignment	(1)

0x0000032e:     DW_TAG_enumerator
                  DW_AT_name	("Exe")
                  DW_AT_const_value	(0)

0x00000334:     DW_TAG_enumerator
                  DW_AT_name	("Lib")
                  DW_AT_const_value	(1)

0x0000033a:     DW_TAG_enumerator
                  DW_AT_name	("Obj")
                  DW_AT_const_value	(2)

0x00000340:     NULL

0x00000341:   DW_TAG_base_type
                DW_AT_name	("u2")
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_byte_size	(0x01)

0x00000348:   DW_TAG_variable
                DW_AT_name	("link_mode")
                DW_AT_type	(0x00000357 "builtin.LinkMode")
                DW_AT_decl_file	("/Users/antoine/.cache/zig/o/696ab8ea543c9d1c252fa3dc6efbb2c8/builtin.zig")
                DW_AT_decl_line	(9)
                DW_AT_linkage_name	("builtin.link_mode")

0x00000357:   DW_TAG_enumeration_type
                DW_AT_type	(0x00000372 "u1")
                DW_AT_name	("builtin.LinkMode")
                DW_AT_byte_size	(0x01)
                DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/builtin.zig")
                DW_AT_decl_line	(637)
                DW_AT_alignment	(1)

0x00000365:     DW_TAG_enumerator
                  DW_AT_name	("Static")
                  DW_AT_const_value	(0)

0x0000036b:     DW_TAG_enumerator
                  DW_AT_name	("Dynamic")
                  DW_AT_const_value	(1)

0x00000371:     NULL

0x00000372:   DW_TAG_base_type
                DW_AT_name	("u1")
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_byte_size	(0x01)

0x00000379:   DW_TAG_variable
                DW_AT_name	("os")
                DW_AT_type	(0x00000388 "target.Target.Os")
                DW_AT_decl_file	("/Users/antoine/.cache/zig/o/696ab8ea543c9d1c252fa3dc6efbb2c8/builtin.zig")
                DW_AT_decl_line	(21)
                DW_AT_linkage_name	("builtin.os")

0x00000388:   DW_TAG_structure_type
                DW_AT_name	("target.Target.Os")
                DW_AT_byte_size	(0x5c)
                DW_AT_alignment	(4)

0x0000038f:     DW_TAG_member
                  DW_AT_name	("version_range")
                  DW_AT_type	(0x00000576 "target.Target.Os.VersionRange")
                  DW_AT_alignment	(4)
                  DW_AT_data_member_location	(0x00)

0x0000039a:     DW_TAG_enumeration_type
                  DW_AT_type	(0x0000067d "u32")
                  DW_AT_name	("target.Target.Os.WindowsVersion")
                  DW_AT_byte_size	(0x04)
                  DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/target.zig")
                  DW_AT_decl_line	(440)
                  DW_AT_alignment	(4)

0x000003a8:       DW_TAG_enumerator
                    DW_AT_name	("nt4")
                    DW_AT_const_value	(67108864)

0x000003b1:       DW_TAG_enumerator
                    DW_AT_name	("win2k")
                    DW_AT_const_value	(83886080)

0x000003ba:       DW_TAG_enumerator
                    DW_AT_name	("xp")
                    DW_AT_const_value	(83951616)

0x000003c3:       DW_TAG_enumerator
                    DW_AT_name	("ws2003")
                    DW_AT_const_value	(84017152)

0x000003cc:       DW_TAG_enumerator
                    DW_AT_name	("vista")
                    DW_AT_const_value	(100663296)

0x000003d5:       DW_TAG_enumerator
                    DW_AT_name	("win7")
                    DW_AT_const_value	(100728832)

0x000003de:       DW_TAG_enumerator
                    DW_AT_name	("win8")
                    DW_AT_const_value	(100794368)

0x000003e7:       DW_TAG_enumerator
                    DW_AT_name	("win8_1")
                    DW_AT_const_value	(100859904)

0x000003f0:       DW_TAG_enumerator
                    DW_AT_name	("win10")
                    DW_AT_const_value	(167772160)

0x000003f9:       DW_TAG_enumerator
                    DW_AT_name	("win10_th2")
                    DW_AT_const_value	(167772161)

0x00000402:       DW_TAG_enumerator
                    DW_AT_name	("win10_rs1")
                    DW_AT_const_value	(167772162)

0x0000040b:       DW_TAG_enumerator
                    DW_AT_name	("win10_rs2")
                    DW_AT_const_value	(167772163)

0x00000414:       DW_TAG_enumerator
                    DW_AT_name	("win10_rs3")
                    DW_AT_const_value	(167772164)

0x0000041d:       DW_TAG_enumerator
                    DW_AT_name	("win10_rs4")
                    DW_AT_const_value	(167772165)

0x00000426:       DW_TAG_enumerator
                    DW_AT_name	("win10_rs5")
                    DW_AT_const_value	(167772166)

0x0000042f:       DW_TAG_enumerator
                    DW_AT_name	("win10_19h1")
                    DW_AT_const_value	(167772167)

0x00000438:       DW_TAG_enumerator
                    DW_AT_name	("win10_vb")
                    DW_AT_const_value	(167772168)

0x00000441:       DW_TAG_enumerator
                    DW_AT_name	("win10_mn")
                    DW_AT_const_value	(167772169)

0x0000044a:       DW_TAG_enumerator
                    DW_AT_name	("win10_fe")
                    DW_AT_const_value	(167772170)

0x00000453:       NULL

0x00000454:     DW_TAG_member
                  DW_AT_name	("tag")
                  DW_AT_type	(0x0000045f "target.Target.Os::target.Target.Os.Tag")
                  DW_AT_alignment	(1)
                  DW_AT_data_member_location	(0x58)

0x0000045f:     DW_TAG_enumeration_type
                  DW_AT_type	(0x000002f4 "u6")
                  DW_AT_name	("target.Target.Os.Tag")
                  DW_AT_byte_size	(0x01)
                  DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/target.zig")
                  DW_AT_decl_line	(189)
                  DW_AT_alignment	(1)

0x0000046c:       DW_TAG_enumerator
                    DW_AT_name	("freestanding")
                    DW_AT_const_value	(0)

0x00000472:       DW_TAG_enumerator
                    DW_AT_name	("ananas")
                    DW_AT_const_value	(1)

0x00000478:       DW_TAG_enumerator
                    DW_AT_name	("cloudabi")
                    DW_AT_const_value	(2)

0x0000047e:       DW_TAG_enumerator
                    DW_AT_name	("dragonfly")
                    DW_AT_const_value	(3)

0x00000484:       DW_TAG_enumerator
                    DW_AT_name	("freebsd")
                    DW_AT_const_value	(4)

0x0000048a:       DW_TAG_enumerator
                    DW_AT_name	("fuchsia")
                    DW_AT_const_value	(5)

0x00000490:       DW_TAG_enumerator
                    DW_AT_name	("ios")
                    DW_AT_const_value	(6)

0x00000496:       DW_TAG_enumerator
                    DW_AT_name	("kfreebsd")
                    DW_AT_const_value	(7)

0x0000049c:       DW_TAG_enumerator
                    DW_AT_name	("linux")
                    DW_AT_const_value	(8)

0x000004a2:       DW_TAG_enumerator
                    DW_AT_name	("lv2")
                    DW_AT_const_value	(9)

0x000004a8:       DW_TAG_enumerator
                    DW_AT_name	("macos")
                    DW_AT_const_value	(10)

0x000004ae:       DW_TAG_enumerator
                    DW_AT_name	("netbsd")
                    DW_AT_const_value	(11)

0x000004b4:       DW_TAG_enumerator
                    DW_AT_name	("openbsd")
                    DW_AT_const_value	(12)

0x000004ba:       DW_TAG_enumerator
                    DW_AT_name	("solaris")
                    DW_AT_const_value	(13)

0x000004c0:       DW_TAG_enumerator
                    DW_AT_name	("windows")
                    DW_AT_const_value	(14)

0x000004c6:       DW_TAG_enumerator
                    DW_AT_name	("zos")
                    DW_AT_const_value	(15)

0x000004cc:       DW_TAG_enumerator
                    DW_AT_name	("haiku")
                    DW_AT_const_value	(16)

0x000004d2:       DW_TAG_enumerator
                    DW_AT_name	("minix")
                    DW_AT_const_value	(17)

0x000004d8:       DW_TAG_enumerator
                    DW_AT_name	("rtems")
                    DW_AT_const_value	(18)

0x000004de:       DW_TAG_enumerator
                    DW_AT_name	("nacl")
                    DW_AT_const_value	(19)

0x000004e4:       DW_TAG_enumerator
                    DW_AT_name	("aix")
                    DW_AT_const_value	(20)

0x000004ea:       DW_TAG_enumerator
                    DW_AT_name	("cuda")
                    DW_AT_const_value	(21)

0x000004f0:       DW_TAG_enumerator
                    DW_AT_name	("nvcl")
                    DW_AT_const_value	(22)

0x000004f6:       DW_TAG_enumerator
                    DW_AT_name	("amdhsa")
                    DW_AT_const_value	(23)

0x000004fc:       DW_TAG_enumerator
                    DW_AT_name	("ps4")
                    DW_AT_const_value	(24)

0x00000502:       DW_TAG_enumerator
                    DW_AT_name	("ps5")
                    DW_AT_const_value	(25)

0x00000508:       DW_TAG_enumerator
                    DW_AT_name	("elfiamcu")
                    DW_AT_const_value	(26)

0x0000050e:       DW_TAG_enumerator
                    DW_AT_name	("tvos")
                    DW_AT_const_value	(27)

0x00000514:       DW_TAG_enumerator
                    DW_AT_name	("watchos")
                    DW_AT_const_value	(28)

0x0000051a:       DW_TAG_enumerator
                    DW_AT_name	("driverkit")
                    DW_AT_const_value	(29)

0x00000520:       DW_TAG_enumerator
                    DW_AT_name	("mesa3d")
                    DW_AT_const_value	(30)

0x00000526:       DW_TAG_enumerator
                    DW_AT_name	("contiki")
                    DW_AT_const_value	(31)

0x0000052c:       DW_TAG_enumerator
                    DW_AT_name	("amdpal")
                    DW_AT_const_value	(32)

0x00000532:       DW_TAG_enumerator
                    DW_AT_name	("hermit")
                    DW_AT_const_value	(33)

0x00000538:       DW_TAG_enumerator
                    DW_AT_name	("hurd")
                    DW_AT_const_value	(34)

0x0000053e:       DW_TAG_enumerator
                    DW_AT_name	("wasi")
                    DW_AT_const_value	(35)

0x00000544:       DW_TAG_enumerator
                    DW_AT_name	("emscripten")
                    DW_AT_const_value	(36)

0x0000054a:       DW_TAG_enumerator
                    DW_AT_name	("shadermodel")
                    DW_AT_const_value	(37)

0x00000550:       DW_TAG_enumerator
                    DW_AT_name	("uefi")
                    DW_AT_const_value	(38)

0x00000556:       DW_TAG_enumerator
                    DW_AT_name	("opencl")
                    DW_AT_const_value	(39)

0x0000055c:       DW_TAG_enumerator
                    DW_AT_name	("glsl450")
                    DW_AT_const_value	(40)

0x00000562:       DW_TAG_enumerator
                    DW_AT_name	("vulkan")
                    DW_AT_const_value	(41)

0x00000568:       DW_TAG_enumerator
                    DW_AT_name	("plan9")
                    DW_AT_const_value	(42)

0x0000056e:       DW_TAG_enumerator
                    DW_AT_name	("other")
                    DW_AT_const_value	(43)

0x00000574:       NULL

0x00000575:     NULL

0x00000576:   DW_TAG_structure_type
                DW_AT_name	("target.Target.Os.VersionRange")
                DW_AT_byte_size	(0x58)
                DW_AT_alignment	(4)

0x0000057d:     DW_TAG_member
                  DW_AT_name	("payload")
                  DW_AT_type	(0x000005bb "target.Target.Os.VersionRange:Payload")
                  DW_AT_alignment	(4)
                  DW_AT_data_member_location	(0x00)

0x00000588:     DW_TAG_member
                  DW_AT_name	("tag")
                  DW_AT_type	(0x00000593 "target.Target.Os.VersionRange::@typeInfo(target.Target.Os.VersionRange).Union.tag_type.?")
                  DW_AT_alignment	(1)
                  DW_AT_data_member_location	(0x54)

0x00000593:     DW_TAG_enumeration_type
                  DW_AT_type	(0x00000341 "u2")
                  DW_AT_name	("@typeInfo(target.Target.Os.VersionRange).Union.tag_type.?")
                  DW_AT_byte_size	(0x01)
                  DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/target.zig")
                  DW_AT_decl_line	(695)
                  DW_AT_alignment	(1)

0x000005a1:       DW_TAG_enumerator
                    DW_AT_name	("none")
                    DW_AT_const_value	(0)

0x000005a7:       DW_TAG_enumerator
                    DW_AT_name	("semver")
                    DW_AT_const_value	(1)

0x000005ad:       DW_TAG_enumerator
                    DW_AT_name	("linux")
                    DW_AT_const_value	(2)

0x000005b3:       DW_TAG_enumerator
                    DW_AT_name	("windows")
                    DW_AT_const_value	(3)

0x000005b9:       NULL

0x000005ba:     NULL

0x000005bb:   DW_TAG_union_type
                DW_AT_name	("target.Target.Os.VersionRange:Payload")
                DW_AT_byte_size	(0x58)
                DW_AT_alignment	(4)

0x000005c2:     DW_TAG_member
                  DW_AT_name	("semver")
                  DW_AT_type	(0x000005e4 "SemanticVersion.Range")
                  DW_AT_alignment	(4)
                  DW_AT_data_member_location	(0x00)

0x000005cd:     DW_TAG_member
                  DW_AT_name	("linux")
                  DW_AT_type	(0x00000641 "target.Target.Os.LinuxVersionRange")
                  DW_AT_alignment	(4)
                  DW_AT_data_member_location	(0x00)

0x000005d8:     DW_TAG_member
                  DW_AT_name	("windows")
                  DW_AT_type	(0x0000065f "target.Target.Os.WindowsVersion.Range")
                  DW_AT_alignment	(4)
                  DW_AT_data_member_location	(0x00)

0x000005e3:     NULL

0x000005e4:   DW_TAG_structure_type
                DW_AT_name	("SemanticVersion.Range")
                DW_AT_byte_size	(0x38)
                DW_AT_alignment	(4)

0x000005eb:     DW_TAG_member
                  DW_AT_name	("min")
                  DW_AT_type	(0x00000602 "SemanticVersion")
                  DW_AT_alignment	(4)
                  DW_AT_data_member_location	(0x00)

0x000005f6:     DW_TAG_member
                  DW_AT_name	("max")
                  DW_AT_type	(0x00000602 "SemanticVersion")
                  DW_AT_alignment	(4)
                  DW_AT_data_member_location	(0x1c)

0x00000601:     NULL

0x00000602:   DW_TAG_structure_type
                DW_AT_name	("SemanticVersion")
                DW_AT_byte_size	(0x1c)
                DW_AT_alignment	(4)

0x00000609:     DW_TAG_member
                  DW_AT_name	("major")
                  DW_AT_type	(0x000000c2 "usize")
                  DW_AT_alignment	(4)
                  DW_AT_data_member_location	(0x00)

0x00000614:     DW_TAG_member
                  DW_AT_name	("minor")
                  DW_AT_type	(0x000000c2 "usize")
                  DW_AT_alignment	(4)
                  DW_AT_data_member_location	(0x04)

0x0000061f:     DW_TAG_member
                  DW_AT_name	("patch")
                  DW_AT_type	(0x000000c2 "usize")
                  DW_AT_alignment	(4)
                  DW_AT_data_member_location	(0x08)

0x0000062a:     DW_TAG_member
                  DW_AT_name	("pre")
                  DW_AT_type	(0x00000108 "[]u8")
                  DW_AT_alignment	(4)
                  DW_AT_data_member_location	(0x0c)

0x00000635:     DW_TAG_member
                  DW_AT_name	("build")
                  DW_AT_type	(0x00000108 "[]u8")
                  DW_AT_alignment	(4)
                  DW_AT_data_member_location	(0x14)

0x00000640:     NULL

0x00000641:   DW_TAG_structure_type
                DW_AT_name	("target.Target.Os.LinuxVersionRange")
                DW_AT_byte_size	(0x54)
                DW_AT_alignment	(4)

0x00000648:     DW_TAG_member
                  DW_AT_name	("range")
                  DW_AT_type	(0x000005e4 "SemanticVersion.Range")
                  DW_AT_alignment	(4)
                  DW_AT_data_member_location	(0x00)

0x00000653:     DW_TAG_member
                  DW_AT_name	("glibc")
                  DW_AT_type	(0x00000602 "SemanticVersion")
                  DW_AT_alignment	(4)
                  DW_AT_data_member_location	(0x38)

0x0000065e:     NULL

0x0000065f:   DW_TAG_structure_type
                DW_AT_name	("target.Target.Os.WindowsVersion.Range")
                DW_AT_byte_size	(0x08)
                DW_AT_alignment	(4)

0x00000666:     DW_TAG_member
                  DW_AT_name	("min")
                  DW_AT_type	(0x0000039a "target.Target.Os::target.Target.Os.WindowsVersion")
                  DW_AT_alignment	(4)
                  DW_AT_data_member_location	(0x00)

0x00000671:     DW_TAG_member
                  DW_AT_name	("max")
                  DW_AT_type	(0x0000039a "target.Target.Os::target.Target.Os.WindowsVersion")
                  DW_AT_alignment	(4)
                  DW_AT_data_member_location	(0x04)

0x0000067c:     NULL

0x0000067d:   DW_TAG_base_type
                DW_AT_name	("u32")
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_byte_size	(0x04)

0x00000684:   DW_TAG_variable
                DW_AT_name	("native_os")
                DW_AT_type	(0x0000045f "target.Target.Os::target.Target.Os.Tag")
                DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/start.zig")
                DW_AT_decl_line	(10)
                DW_AT_linkage_name	("start.native_os")

0x00000693:   DW_TAG_variable
                DW_AT_name	("buffer_size")
                DW_AT_type	(0x000006a2 "i32")
                DW_AT_decl_file	("/Users/antoine/prog/zig-playground/6-canvas/main.zig")
                DW_AT_decl_line	(10)
                DW_AT_linkage_name	("main.buffer_size")

0x000006a2:   DW_TAG_base_type
                DW_AT_name	("i32")
                DW_AT_encoding	(DW_ATE_signed)
                DW_AT_byte_size	(0x04)

0x000006a9:   DW_TAG_variable
                DW_AT_name	("u8WasmToJSBuffer")
                DW_AT_type	(0x000006be "u8[2048]")
                DW_AT_external	(true)
                DW_AT_decl_file	("/Users/antoine/prog/zig-playground/6-canvas/main.zig")
                DW_AT_decl_line	(11)
                DW_AT_location	(DW_OP_addr 0x1003bc)
                DW_AT_linkage_name	("u8WasmToJSBuffer")

0x000006be:   DW_TAG_array_type
                DW_AT_type	(0x0000012f "u8")

0x000006c3:     DW_TAG_subrange_type
                  DW_AT_type	(0x000000c9 "__ARRAY_SIZE_TYPE__")
                  DW_AT_count	(0x0800)

0x000006ca:     NULL

0x000006cb:   DW_TAG_variable
                DW_AT_name	("u8JSToWasmBuffer")
                DW_AT_type	(0x000006be "u8[2048]")
                DW_AT_external	(true)
                DW_AT_decl_file	("/Users/antoine/prog/zig-playground/6-canvas/main.zig")
                DW_AT_decl_line	(12)
                DW_AT_location	(DW_OP_addr 0x100bbc)
                DW_AT_linkage_name	("u8JSToWasmBuffer")

0x000006e0:   DW_TAG_variable
                DW_AT_name	("cast_truncated_data")
                DW_AT_type	(0x000006f0 "u8 (*)[27]")
                DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/builtin.zig")
                DW_AT_decl_line	(855)
                DW_AT_linkage_name	("builtin.panic_messages.cast_truncated_data")

0x000006f0:   DW_TAG_pointer_type
                DW_AT_type	(0x000006f9 "u8[27]")
                DW_AT_name	("*[27:0]u8")

0x000006f9:   DW_TAG_array_type
                DW_AT_type	(0x0000012f "u8")

0x000006fe:     DW_TAG_subrange_type
                  DW_AT_type	(0x000000c9 "__ARRAY_SIZE_TYPE__")
                  DW_AT_count	(0x1b)

0x00000704:     NULL

0x00000705:   DW_TAG_variable
                DW_AT_name	("integer_overflow")
                DW_AT_type	(0x00000715 "u8 (*)[16]")
                DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/builtin.zig")
                DW_AT_decl_line	(857)
                DW_AT_linkage_name	("builtin.panic_messages.integer_overflow")

0x00000715:   DW_TAG_pointer_type
                DW_AT_type	(0x0000071e "u8[16]")
                DW_AT_name	("*[16:0]u8")

0x0000071e:   DW_TAG_array_type
                DW_AT_type	(0x0000012f "u8")

0x00000723:     DW_TAG_subrange_type
                  DW_AT_type	(0x000000c9 "__ARRAY_SIZE_TYPE__")
                  DW_AT_count	(0x10)

0x00000729:     NULL

0x0000072a:   DW_TAG_variable
                DW_AT_name	("for_len_mismatch")
                DW_AT_type	(0x0000073a "u8 (*)[44]")
                DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/builtin.zig")
                DW_AT_decl_line	(871)
                DW_AT_linkage_name	("builtin.panic_messages.for_len_mismatch")

0x0000073a:   DW_TAG_pointer_type
                DW_AT_type	(0x00000743 "u8[44]")
                DW_AT_name	("*[44:0]u8")

0x00000743:   DW_TAG_array_type
                DW_AT_type	(0x0000012f "u8")

0x00000748:     DW_TAG_subrange_type
                  DW_AT_type	(0x000000c9 "__ARRAY_SIZE_TYPE__")
                  DW_AT_count	(0x2c)

0x0000074e:     NULL

0x0000074f:   DW_TAG_variable
                DW_AT_name	("memcpy_alias")
                DW_AT_type	(0x0000075f "u8 (*)[23]")
                DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/builtin.zig")
                DW_AT_decl_line	(873)
                DW_AT_linkage_name	("builtin.panic_messages.memcpy_alias")

0x0000075f:   DW_TAG_pointer_type
                DW_AT_type	(0x00000768 "u8[23]")
                DW_AT_name	("*[23:0]u8")

0x00000768:   DW_TAG_array_type
                DW_AT_type	(0x0000012f "u8")

0x0000076d:     DW_TAG_subrange_type
                  DW_AT_type	(0x000000c9 "__ARRAY_SIZE_TYPE__")
                  DW_AT_count	(0x17)

0x00000773:     NULL

0x00000774:   DW_TAG_variable
                DW_AT_name	("corrupt_switch")
                DW_AT_type	(0x0000075f "u8 (*)[23]")
                DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/builtin.zig")
                DW_AT_decl_line	(864)
                DW_AT_linkage_name	("builtin.panic_messages.corrupt_switch")

0x00000784:   DW_TAG_variable
                DW_AT_name	("max_format_args")
                DW_AT_type	(0x00000794 "u16")
                DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/fmt.zig")
                DW_AT_decl_line	(376)
                DW_AT_linkage_name	("fmt.max_format_args")

0x00000794:   DW_TAG_base_type
                DW_AT_name	("u16")
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_byte_size	(0x02)

0x0000079b:   DW_TAG_variable
                DW_AT_name	("ANY")
                DW_AT_type	(0x000007ab "u8 (*)[3]")
                DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/fmt.zig")
                DW_AT_decl_line	(431)
                DW_AT_linkage_name	("fmt.ANY")

0x000007ab:   DW_TAG_pointer_type
                DW_AT_type	(0x000007b4 "u8[3]")
                DW_AT_name	("*[3:0]u8")

0x000007b4:   DW_TAG_array_type
                DW_AT_type	(0x0000012f "u8")

0x000007b9:     DW_TAG_subrange_type
                  DW_AT_type	(0x000000c9 "__ARRAY_SIZE_TYPE__")
                  DW_AT_count	(0x03)

0x000007bf:     NULL

0x000007c0:   DW_TAG_variable
                DW_AT_name	("divide_by_zero")
                DW_AT_type	(0x00000715 "u8 (*)[16]")
                DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/builtin.zig")
                DW_AT_decl_line	(860)
                DW_AT_linkage_name	("builtin.panic_messages.divide_by_zero")

0x000007d0:   DW_TAG_variable
                DW_AT_name	("unreach")
                DW_AT_type	(0x000007e0 "u8 (*)[24]")
                DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/builtin.zig")
                DW_AT_decl_line	(850)
                DW_AT_linkage_name	("builtin.panic_messages.unreach")

0x000007e0:   DW_TAG_pointer_type
                DW_AT_type	(0x000007e9 "u8[24]")
                DW_AT_name	("*[24:0]u8")

0x000007e9:   DW_TAG_array_type
                DW_AT_type	(0x0000012f "u8")

0x000007ee:     DW_TAG_subrange_type
                  DW_AT_type	(0x000000c9 "__ARRAY_SIZE_TYPE__")
                  DW_AT_count	(0x18)

0x000007f4:     NULL

0x000007f5:   DW_TAG_variable
                DW_AT_name	("memcpy_len_mismatch")
                DW_AT_type	(0x00000805 "u8 (*)[40]")
                DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/builtin.zig")
                DW_AT_decl_line	(872)
                DW_AT_linkage_name	("builtin.panic_messages.memcpy_len_mismatch")

0x00000805:   DW_TAG_pointer_type
                DW_AT_type	(0x0000080e "u8[40]")
                DW_AT_name	("*[40:0]u8")

0x0000080e:   DW_TAG_array_type
                DW_AT_type	(0x0000012f "u8")

0x00000813:     DW_TAG_subrange_type
                  DW_AT_type	(0x000000c9 "__ARRAY_SIZE_TYPE__")
                  DW_AT_count	(0x28)

0x00000819:     NULL

0x0000081a:   DW_TAG_variable
                DW_AT_name	("shift_rhs_too_big")
                DW_AT_type	(0x0000082a "u8 (*)[42]")
                DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/builtin.zig")
                DW_AT_decl_line	(865)
                DW_AT_linkage_name	("builtin.panic_messages.shift_rhs_too_big")

0x0000082a:   DW_TAG_pointer_type
                DW_AT_type	(0x00000833 "u8[42]")
                DW_AT_name	("*[42:0]u8")

0x00000833:   DW_TAG_array_type
                DW_AT_type	(0x0000012f "u8")

0x00000838:     DW_TAG_subrange_type
                  DW_AT_type	(0x000000c9 "__ARRAY_SIZE_TYPE__")
                  DW_AT_count	(0x2a)

0x0000083e:     NULL

0x0000083f:   DW_TAG_variable
                DW_AT_name	("generic__anon_435")
                DW_AT_type	(0x0000084e "u8[7]")
                DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/target/wasm.zig")
                DW_AT_decl_line	(113)
                DW_AT_linkage_name	("target.wasm.cpu.generic__anon_435")

0x0000084e:   DW_TAG_array_type
                DW_AT_type	(0x0000012f "u8")

0x00000853:     DW_TAG_subrange_type
                  DW_AT_type	(0x000000c9 "__ARRAY_SIZE_TYPE__")
                  DW_AT_count	(0x07)

0x00000859:     NULL

0x0000085a:   DW_TAG_variable
                DW_AT_name	("main__anon_831")
                DW_AT_type	(0x00000869 "u8[12]")
                DW_AT_decl_file	("/Users/antoine/prog/zig-playground/6-canvas/main.zig")
                DW_AT_decl_line	(87)
                DW_AT_linkage_name	("main.main__anon_831")

0x00000869:   DW_TAG_array_type
                DW_AT_type	(0x0000012f "u8")

0x0000086e:     DW_TAG_subrange_type
                  DW_AT_type	(0x000000c9 "__ARRAY_SIZE_TYPE__")
                  DW_AT_count	(0x0c)

0x00000874:     NULL

0x00000875:   DW_TAG_variable
                DW_AT_name	("main__anon_834")
                DW_AT_type	(0x00000869 "u8[12]")
                DW_AT_decl_file	("/Users/antoine/prog/zig-playground/6-canvas/main.zig")
                DW_AT_decl_line	(87)
                DW_AT_linkage_name	("main.main__anon_834")

0x00000884:   DW_TAG_variable
                DW_AT_name	("main__anon_835")
                DW_AT_type	(0x00000893 "u8[11]")
                DW_AT_decl_file	("/Users/antoine/prog/zig-playground/6-canvas/main.zig")
                DW_AT_decl_line	(87)
                DW_AT_linkage_name	("main.main__anon_835")

0x00000893:   DW_TAG_array_type
                DW_AT_type	(0x0000012f "u8")

0x00000898:     DW_TAG_subrange_type
                  DW_AT_type	(0x000000c9 "__ARRAY_SIZE_TYPE__")
                  DW_AT_count	(0x0b)

0x0000089e:     NULL

0x0000089f:   DW_TAG_variable
                DW_AT_name	("main__anon_838")
                DW_AT_type	(0x000008ae "u8[8]")
                DW_AT_decl_file	("/Users/antoine/prog/zig-playground/6-canvas/main.zig")
                DW_AT_decl_line	(87)
                DW_AT_linkage_name	("main.main__anon_838")

0x000008ae:   DW_TAG_array_type
                DW_AT_type	(0x0000012f "u8")

0x000008b3:     DW_TAG_subrange_type
                  DW_AT_type	(0x000000c9 "__ARRAY_SIZE_TYPE__")
                  DW_AT_count	(0x08)

0x000008b9:     NULL

0x000008ba:   DW_TAG_variable
                DW_AT_name	("main__anon_841")
                DW_AT_type	(0x000008ae "u8[8]")
                DW_AT_decl_file	("/Users/antoine/prog/zig-playground/6-canvas/main.zig")
                DW_AT_decl_line	(87)
                DW_AT_linkage_name	("main.main__anon_841")

0x000008c9:   DW_TAG_variable
                DW_AT_name	("main__anon_842")
                DW_AT_type	(0x000008d8 "u8[21]")
                DW_AT_decl_file	("/Users/antoine/prog/zig-playground/6-canvas/main.zig")
                DW_AT_decl_line	(87)
                DW_AT_linkage_name	("main.main__anon_842")

0x000008d8:   DW_TAG_array_type
                DW_AT_type	(0x0000012f "u8")

0x000008dd:     DW_TAG_subrange_type
                  DW_AT_type	(0x000000c9 "__ARRAY_SIZE_TYPE__")
                  DW_AT_count	(0x15)

0x000008e3:     NULL

0x000008e4:   DW_TAG_variable
                DW_AT_name	("main__anon_843")
                DW_AT_type	(0x0000084e "u8[7]")
                DW_AT_decl_file	("/Users/antoine/prog/zig-playground/6-canvas/main.zig")
                DW_AT_decl_line	(87)
                DW_AT_linkage_name	("main.main__anon_843")

0x000008f3:   DW_TAG_variable
                DW_AT_name	("main__anon_844")
                DW_AT_type	(0x00000893 "u8[11]")
                DW_AT_decl_file	("/Users/antoine/prog/zig-playground/6-canvas/main.zig")
                DW_AT_decl_line	(87)
                DW_AT_linkage_name	("main.main__anon_844")

0x00000902:   DW_TAG_variable
                DW_AT_name	("main__anon_845")
                DW_AT_type	(0x000008d8 "u8[21]")
                DW_AT_decl_file	("/Users/antoine/prog/zig-playground/6-canvas/main.zig")
                DW_AT_decl_line	(87)
                DW_AT_linkage_name	("main.main__anon_845")

0x00000911:   DW_TAG_variable
                DW_AT_name	("cast_truncated_data__anon_1138")
                DW_AT_type	(0x000006f9 "u8[27]")
                DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/builtin.zig")
                DW_AT_decl_line	(855)
                DW_AT_linkage_name	("builtin.panic_messages.cast_truncated_data__anon_1138")

0x00000921:   DW_TAG_variable
                DW_AT_name	("integer_overflow__anon_1139")
                DW_AT_type	(0x0000071e "u8[16]")
                DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/builtin.zig")
                DW_AT_decl_line	(857)
                DW_AT_linkage_name	("builtin.panic_messages.integer_overflow__anon_1139")

0x00000931:   DW_TAG_variable
                DW_AT_name	("debug__anon_839__anon_1140")
                DW_AT_type	(0x00000893 "u8[11]")
                DW_AT_decl_file	("/Users/antoine/prog/zig-playground/6-canvas/main.zig")
                DW_AT_decl_line	(80)
                DW_AT_linkage_name	("main.debug__anon_839__anon_1140")

0x00000940:   DW_TAG_variable
                DW_AT_name	("panicStartGreaterThanEnd__anon_1238")
                DW_AT_type	(0x00000743 "u8[44]")
                DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/builtin.zig")
                DW_AT_decl_line	(839)
                DW_AT_linkage_name	("builtin.panicStartGreaterThanEnd__anon_1238")

0x00000950:   DW_TAG_variable
                DW_AT_name	("panicOutOfBounds__anon_1240")
                DW_AT_type	(0x00000960 "u8[39]")
                DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/builtin.zig")
                DW_AT_decl_line	(834)
                DW_AT_linkage_name	("builtin.panicOutOfBounds__anon_1240")

0x00000960:   DW_TAG_array_type
                DW_AT_type	(0x0000012f "u8")

0x00000965:     DW_TAG_subrange_type
                  DW_AT_type	(0x000000c9 "__ARRAY_SIZE_TYPE__")
                  DW_AT_count	(0x27)

0x0000096b:     NULL

0x0000096c:   DW_TAG_variable
                DW_AT_name	("for_len_mismatch__anon_1242")
                DW_AT_type	(0x00000743 "u8[44]")
                DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/builtin.zig")
                DW_AT_decl_line	(871)
                DW_AT_linkage_name	("builtin.panic_messages.for_len_mismatch__anon_1242")

0x0000097c:   DW_TAG_variable
                DW_AT_name	("panicExtra__anon_1239__anon_1243")
                DW_AT_type	(0x0000098c "u8[15]")
                DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/debug.zig")
                DW_AT_decl_line	(354)
                DW_AT_linkage_name	("debug.panicExtra__anon_1239__anon_1243")

0x0000098c:   DW_TAG_array_type
                DW_AT_type	(0x0000012f "u8")

0x00000991:     DW_TAG_subrange_type
                  DW_AT_type	(0x000000c9 "__ARRAY_SIZE_TYPE__")
                  DW_AT_count	(0x0f)

0x00000997:     NULL

0x00000998:   DW_TAG_variable
                DW_AT_name	("memcpy_alias__anon_1389")
                DW_AT_type	(0x00000768 "u8[23]")
                DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/builtin.zig")
                DW_AT_decl_line	(873)
                DW_AT_linkage_name	("builtin.panic_messages.memcpy_alias__anon_1389")

0x000009a8:   DW_TAG_variable
                DW_AT_name	("corrupt_switch__anon_1390")
                DW_AT_type	(0x00000768 "u8[23]")
                DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/builtin.zig")
                DW_AT_decl_line	(864)
                DW_AT_linkage_name	("builtin.panic_messages.corrupt_switch__anon_1390")

0x000009b8:   DW_TAG_variable
                DW_AT_name	("format__anon_1513__anon_1521")
                DW_AT_type	(0x000009c7 "fmt.ArgState")
                DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/fmt.zig")
                DW_AT_decl_line	(79)
                DW_AT_linkage_name	("fmt.format__anon_1513__anon_1521")

0x000009c7:   DW_TAG_structure_type
                DW_AT_name	("fmt.ArgState")
                DW_AT_byte_size	(0x0c)
                DW_AT_alignment	(4)

0x000009ce:     DW_TAG_member
                  DW_AT_name	("next_arg")
                  DW_AT_type	(0x000000c2 "usize")
                  DW_AT_alignment	(4)
                  DW_AT_data_member_location	(0x00)

0x000009d9:     DW_TAG_member
                  DW_AT_name	("used_args")
                  DW_AT_type	(0x0000067d "u32")
                  DW_AT_alignment	(4)
                  DW_AT_data_member_location	(0x04)

0x000009e4:     DW_TAG_member
                  DW_AT_name	("args_len")
                  DW_AT_type	(0x000000c2 "usize")
                  DW_AT_alignment	(4)
                  DW_AT_data_member_location	(0x08)

0x000009ef:     NULL

0x000009f0:   DW_TAG_variable
                DW_AT_name	("format__anon_1513__anon_1524")
                DW_AT_type	(0x0000030a "bool")
                DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/fmt.zig")
                DW_AT_decl_line	(79)
                DW_AT_linkage_name	("fmt.format__anon_1513__anon_1524")

0x000009ff:   DW_TAG_variable
                DW_AT_name	("cacheString__anon_1559")
                DW_AT_type	(0x00000a0e "u8[1]")
                DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/fmt.zig")
                DW_AT_decl_line	(208)
                DW_AT_linkage_name	("fmt.cacheString__anon_1559")

0x00000a0e:   DW_TAG_array_type
                DW_AT_type	(0x0000012f "u8")

0x00000a13:     DW_TAG_subrange_type
                  DW_AT_type	(0x000000c9 "__ARRAY_SIZE_TYPE__")
                  DW_AT_count	(0x01)

0x00000a19:     NULL

0x00000a1a:   DW_TAG_variable
                DW_AT_name	("format__anon_1513__anon_1581")
                DW_AT_type	(0x0000030a "bool")
                DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/fmt.zig")
                DW_AT_decl_line	(79)
                DW_AT_linkage_name	("fmt.format__anon_1513__anon_1581")

0x00000a29:   DW_TAG_variable
                DW_AT_name	("format__anon_1586__anon_1591")
                DW_AT_type	(0x000009c7 "fmt.ArgState")
                DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/fmt.zig")
                DW_AT_decl_line	(79)
                DW_AT_linkage_name	("fmt.format__anon_1586__anon_1591")

0x00000a38:   DW_TAG_variable
                DW_AT_name	("format__anon_1586__anon_1594")
                DW_AT_type	(0x0000030a "bool")
                DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/fmt.zig")
                DW_AT_decl_line	(79)
                DW_AT_linkage_name	("fmt.format__anon_1586__anon_1594")

0x00000a47:   DW_TAG_variable
                DW_AT_name	("format__anon_1586__anon_1600")
                DW_AT_type	(0x0000030a "bool")
                DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/fmt.zig")
                DW_AT_decl_line	(79)
                DW_AT_linkage_name	("fmt.format__anon_1586__anon_1600")

0x00000a56:   DW_TAG_variable
                DW_AT_name	("ANY__anon_1605")
                DW_AT_type	(0x000007b4 "u8[3]")
                DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/fmt.zig")
                DW_AT_decl_line	(431)
                DW_AT_linkage_name	("fmt.ANY__anon_1605")

0x00000a66:   DW_TAG_variable
                DW_AT_name	("formatIntValue__anon_1670__anon_1673")
                DW_AT_type	(0x00000a76 "fmt.Case")
                DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/fmt.zig")
                DW_AT_decl_line	(739)
                DW_AT_linkage_name	("fmt.formatIntValue__anon_1670__anon_1673")

0x00000a76:   DW_TAG_enumeration_type
                DW_AT_type	(0x00000372 "u1")
                DW_AT_name	("fmt.Case")
                DW_AT_byte_size	(0x01)
                DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/fmt.zig")
                DW_AT_decl_line	(2548)
                DW_AT_alignment	(1)

0x00000a84:     DW_TAG_enumerator
                  DW_AT_name	("lower")
                  DW_AT_const_value	(0)

0x00000a8a:     DW_TAG_enumerator
                  DW_AT_name	("upper")
                  DW_AT_const_value	(1)

0x00000a90:     NULL

0x00000a91:   DW_TAG_variable
                DW_AT_name	("divide_by_zero__anon_1678")
                DW_AT_type	(0x0000071e "u8[16]")
                DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/builtin.zig")
                DW_AT_decl_line	(860)
                DW_AT_linkage_name	("builtin.panic_messages.divide_by_zero__anon_1678")

0x00000aa1:   DW_TAG_variable
                DW_AT_name	("unreach__anon_1757")
                DW_AT_type	(0x000007e9 "u8[24]")
                DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/builtin.zig")
                DW_AT_decl_line	(850)
                DW_AT_linkage_name	("builtin.panic_messages.unreach__anon_1757")

0x00000ab1:   DW_TAG_variable
                DW_AT_name	("digits2__anon_1766")
                DW_AT_type	(0x00000ac1 "u8[200]")
                DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/fmt.zig")
                DW_AT_decl_line	(1470)
                DW_AT_linkage_name	("fmt.digits2__anon_1766")

0x00000ac1:   DW_TAG_array_type
                DW_AT_type	(0x0000012f "u8")

0x00000ac6:     DW_TAG_subrange_type
                  DW_AT_type	(0x000000c9 "__ARRAY_SIZE_TYPE__")
                  DW_AT_count	(0xc8)

0x00000acc:     NULL

0x00000acd:   DW_TAG_variable
                DW_AT_name	("memcpy_len_mismatch__anon_1768")
                DW_AT_type	(0x0000080e "u8[40]")
                DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/builtin.zig")
                DW_AT_decl_line	(872)
                DW_AT_linkage_name	("builtin.panic_messages.memcpy_len_mismatch__anon_1768")

0x00000add:   DW_TAG_variable
                DW_AT_name	("shift_rhs_too_big__anon_1769")
                DW_AT_type	(0x00000833 "u8[42]")
                DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/builtin.zig")
                DW_AT_decl_line	(865)
                DW_AT_linkage_name	("builtin.panic_messages.shift_rhs_too_big__anon_1769")

0x00000aed:   DW_TAG_enumeration_type
                DW_AT_type	(0x00000372 "u1")
                DW_AT_name	("builtin.Signedness")
                DW_AT_byte_size	(0x01)
                DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/builtin.zig")
                DW_AT_decl_line	(623)
                DW_AT_alignment	(1)

0x00000afb:     DW_TAG_enumerator
                  DW_AT_name	("signed")
                  DW_AT_const_value	(0)

0x00000b01:     DW_TAG_enumerator
                  DW_AT_name	("unsigned")
                  DW_AT_const_value	(1)

0x00000b07:     NULL

0x00000b08:   DW_TAG_structure_type
                DW_AT_name	("builtin.Type.Pointer")
                DW_AT_byte_size	(0x0c)
                DW_AT_alignment	(4)

0x00000b0f:     DW_TAG_member
                  DW_AT_name	("sentinel")
                  DW_AT_type	(0x00000b79 "anyopaque *")
                  DW_AT_alignment	(4)
                  DW_AT_data_member_location	(0x00)

0x00000b1a:     DW_TAG_member
                  DW_AT_name	("size")
                  DW_AT_type	(0x00000b25 "builtin.Type.Pointer::builtin.Type.Pointer.Size")
                  DW_AT_alignment	(1)
                  DW_AT_data_member_location	(0x04)

0x00000b25:     DW_TAG_enumeration_type
                  DW_AT_type	(0x00000341 "u2")
                  DW_AT_name	("builtin.Type.Pointer.Size")
                  DW_AT_byte_size	(0x01)
                  DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/builtin.zig")
                  DW_AT_decl_line	(440)
                  DW_AT_alignment	(1)

0x00000b33:       DW_TAG_enumerator
                    DW_AT_name	("One")
                    DW_AT_const_value	(0)

0x00000b39:       DW_TAG_enumerator
                    DW_AT_name	("Many")
                    DW_AT_const_value	(1)

0x00000b3f:       DW_TAG_enumerator
                    DW_AT_name	("Slice")
                    DW_AT_const_value	(2)

0x00000b45:       DW_TAG_enumerator
                    DW_AT_name	("C")
                    DW_AT_const_value	(3)

0x00000b4b:       NULL

0x00000b4c:     DW_TAG_member
                  DW_AT_name	("is_const")
                  DW_AT_type	(0x0000030a "bool")
                  DW_AT_alignment	(1)
                  DW_AT_data_member_location	(0x05)

0x00000b57:     DW_TAG_member
                  DW_AT_name	("is_volatile")
                  DW_AT_type	(0x0000030a "bool")
                  DW_AT_alignment	(1)
                  DW_AT_data_member_location	(0x06)

0x00000b62:     DW_TAG_member
                  DW_AT_name	("address_space")
                  DW_AT_type	(0x00000b89 "builtin.AddressSpace")
                  DW_AT_alignment	(1)
                  DW_AT_data_member_location	(0x07)

0x00000b6d:     DW_TAG_member
                  DW_AT_name	("is_allowzero")
                  DW_AT_type	(0x0000030a "bool")
                  DW_AT_alignment	(1)
                  DW_AT_data_member_location	(0x08)

0x00000b78:     NULL

0x00000b79:   DW_TAG_pointer_type
                DW_AT_type	(0x00000b82 "anyopaque")
                DW_AT_name	("*anyopaque")

0x00000b82:   DW_TAG_base_type
                DW_AT_name	("anyopaque")
                DW_AT_encoding	(DW_ATE_signed)
                DW_AT_byte_size	(0x00)

0x00000b89:   DW_TAG_enumeration_type
                DW_AT_type	(0x00000bf2 "u5")
                DW_AT_name	("builtin.AddressSpace")
                DW_AT_byte_size	(0x01)
                DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/builtin.zig")
                DW_AT_decl_line	(333)
                DW_AT_alignment	(1)

0x00000b97:     DW_TAG_enumerator
                  DW_AT_name	("generic")
                  DW_AT_const_value	(0)

0x00000b9d:     DW_TAG_enumerator
                  DW_AT_name	("gs")
                  DW_AT_const_value	(1)

0x00000ba3:     DW_TAG_enumerator
                  DW_AT_name	("fs")
                  DW_AT_const_value	(2)

0x00000ba9:     DW_TAG_enumerator
                  DW_AT_name	("ss")
                  DW_AT_const_value	(3)

0x00000baf:     DW_TAG_enumerator
                  DW_AT_name	("global")
                  DW_AT_const_value	(4)

0x00000bb5:     DW_TAG_enumerator
                  DW_AT_name	("constant")
                  DW_AT_const_value	(5)

0x00000bbb:     DW_TAG_enumerator
                  DW_AT_name	("param")
                  DW_AT_const_value	(6)

0x00000bc1:     DW_TAG_enumerator
                  DW_AT_name	("shared")
                  DW_AT_const_value	(7)

0x00000bc7:     DW_TAG_enumerator
                  DW_AT_name	("local")
                  DW_AT_const_value	(8)

0x00000bcd:     DW_TAG_enumerator
                  DW_AT_name	("flash")
                  DW_AT_const_value	(9)

0x00000bd3:     DW_TAG_enumerator
                  DW_AT_name	("flash1")
                  DW_AT_const_value	(10)

0x00000bd9:     DW_TAG_enumerator
                  DW_AT_name	("flash2")
                  DW_AT_const_value	(11)

0x00000bdf:     DW_TAG_enumerator
                  DW_AT_name	("flash3")
                  DW_AT_const_value	(12)

0x00000be5:     DW_TAG_enumerator
                  DW_AT_name	("flash4")
                  DW_AT_const_value	(13)

0x00000beb:     DW_TAG_enumerator
                  DW_AT_name	("flash5")
                  DW_AT_const_value	(14)

0x00000bf1:     NULL

0x00000bf2:   DW_TAG_base_type
                DW_AT_name	("u5")
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_byte_size	(0x01)

0x00000bf9:   DW_TAG_structure_type
                DW_AT_name	("builtin.Type")
                DW_AT_byte_size	(0x10)
                DW_AT_alignment	(4)

0x00000c00:     DW_TAG_member
                  DW_AT_name	("payload")
                  DW_AT_type	(0x00000cd7 "builtin.Type:Payload")
                  DW_AT_alignment	(4)
                  DW_AT_data_member_location	(0x00)

0x00000c0b:     DW_TAG_enumeration_type
                  DW_AT_type	(0x00000341 "u2")
                  DW_AT_name	("builtin.Type.ContainerLayout")
                  DW_AT_byte_size	(0x01)
                  DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/builtin.zig")
                  DW_AT_decl_line	(461)
                  DW_AT_alignment	(1)

0x00000c19:       DW_TAG_enumerator
                    DW_AT_name	("Auto")
                    DW_AT_const_value	(0)

0x00000c1f:       DW_TAG_enumerator
                    DW_AT_name	("Extern")
                    DW_AT_const_value	(1)

0x00000c25:       DW_TAG_enumerator
                    DW_AT_name	("Packed")
                    DW_AT_const_value	(2)

0x00000c2b:       NULL

0x00000c2c:     DW_TAG_member
                  DW_AT_name	("tag")
                  DW_AT_type	(0x00000c37 "builtin.Type::@typeInfo(builtin.Type).Union.tag_type.?")
                  DW_AT_alignment	(1)
                  DW_AT_data_member_location	(0x0c)

0x00000c37:     DW_TAG_enumeration_type
                  DW_AT_type	(0x00000bf2 "u5")
                  DW_AT_name	("@typeInfo(builtin.Type).Union.tag_type.?")
                  DW_AT_byte_size	(0x01)
                  DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/builtin.zig")
                  DW_AT_decl_line	(605)
                  DW_AT_alignment	(1)

0x00000c45:       DW_TAG_enumerator
                    DW_AT_name	("Type")
                    DW_AT_const_value	(0)

0x00000c4b:       DW_TAG_enumerator
                    DW_AT_name	("Void")
                    DW_AT_const_value	(1)

0x00000c51:       DW_TAG_enumerator
                    DW_AT_name	("Bool")
                    DW_AT_const_value	(2)

0x00000c57:       DW_TAG_enumerator
                    DW_AT_name	("NoReturn")
                    DW_AT_const_value	(3)

0x00000c5d:       DW_TAG_enumerator
                    DW_AT_name	("Int")
                    DW_AT_const_value	(4)

0x00000c63:       DW_TAG_enumerator
                    DW_AT_name	("Float")
                    DW_AT_const_value	(5)

0x00000c69:       DW_TAG_enumerator
                    DW_AT_name	("Pointer")
                    DW_AT_const_value	(6)

0x00000c6f:       DW_TAG_enumerator
                    DW_AT_name	("Array")
                    DW_AT_const_value	(7)

0x00000c75:       DW_TAG_enumerator
                    DW_AT_name	("Struct")
                    DW_AT_const_value	(8)

0x00000c7b:       DW_TAG_enumerator
                    DW_AT_name	("ComptimeFloat")
                    DW_AT_const_value	(9)

0x00000c81:       DW_TAG_enumerator
                    DW_AT_name	("ComptimeInt")
                    DW_AT_const_value	(10)

0x00000c87:       DW_TAG_enumerator
                    DW_AT_name	("Undefined")
                    DW_AT_const_value	(11)

0x00000c8d:       DW_TAG_enumerator
                    DW_AT_name	("Null")
                    DW_AT_const_value	(12)

0x00000c93:       DW_TAG_enumerator
                    DW_AT_name	("Optional")
                    DW_AT_const_value	(13)

0x00000c99:       DW_TAG_enumerator
                    DW_AT_name	("ErrorUnion")
                    DW_AT_const_value	(14)

0x00000c9f:       DW_TAG_enumerator
                    DW_AT_name	("ErrorSet")
                    DW_AT_const_value	(15)

0x00000ca5:       DW_TAG_enumerator
                    DW_AT_name	("Enum")
                    DW_AT_const_value	(16)

0x00000cab:       DW_TAG_enumerator
                    DW_AT_name	("Union")
                    DW_AT_const_value	(17)

0x00000cb1:       DW_TAG_enumerator
                    DW_AT_name	("Fn")
                    DW_AT_const_value	(18)

0x00000cb7:       DW_TAG_enumerator
                    DW_AT_name	("Opaque")
                    DW_AT_const_value	(19)

0x00000cbd:       DW_TAG_enumerator
                    DW_AT_name	("Frame")
                    DW_AT_const_value	(20)

0x00000cc3:       DW_TAG_enumerator
                    DW_AT_name	("AnyFrame")
                    DW_AT_const_value	(21)

0x00000cc9:       DW_TAG_enumerator
                    DW_AT_name	("Vector")
                    DW_AT_const_value	(22)

0x00000ccf:       DW_TAG_enumerator
                    DW_AT_name	("EnumLiteral")
                    DW_AT_const_value	(23)

0x00000cd5:       NULL

0x00000cd6:     NULL

0x00000cd7:   DW_TAG_union_type
                DW_AT_name	("builtin.Type:Payload")
                DW_AT_byte_size	(0x10)
                DW_AT_alignment	(4)

0x00000cde:     DW_TAG_member
                  DW_AT_name	("Int")
                  DW_AT_type	(0x00000d62 "builtin.Type.Int")
                  DW_AT_alignment	(2)
                  DW_AT_data_member_location	(0x00)

0x00000ce9:     DW_TAG_member
                  DW_AT_name	("Float")
                  DW_AT_type	(0x00000d80 "builtin.Type.Float")
                  DW_AT_alignment	(2)
                  DW_AT_data_member_location	(0x00)

0x00000cf4:     DW_TAG_member
                  DW_AT_name	("Pointer")
                  DW_AT_type	(0x00000b08 "builtin.Type.Pointer")
                  DW_AT_alignment	(4)
                  DW_AT_data_member_location	(0x00)

0x00000cff:     DW_TAG_member
                  DW_AT_name	("Array")
                  DW_AT_type	(0x00000d93 "builtin.Type.Array")
                  DW_AT_alignment	(4)
                  DW_AT_data_member_location	(0x00)

0x00000d0a:     DW_TAG_member
                  DW_AT_name	("Struct")
                  DW_AT_type	(0x00000da6 "builtin.Type.Struct")
                  DW_AT_alignment	(4)
                  DW_AT_data_member_location	(0x00)

0x00000d15:     DW_TAG_member
                  DW_AT_name	("ErrorSet")
                  DW_AT_type	(0x00000e09 "[]builtin.Type.Error")
                  DW_AT_alignment	(4)
                  DW_AT_data_member_location	(0x00)

0x00000d20:     DW_TAG_member
                  DW_AT_name	("Enum")
                  DW_AT_type	(0x00000e43 "builtin.Type.Enum")
                  DW_AT_alignment	(4)
                  DW_AT_data_member_location	(0x00)

0x00000d2b:     DW_TAG_member
                  DW_AT_name	("Union")
                  DW_AT_type	(0x00000e61 "builtin.Type.Union")
                  DW_AT_alignment	(4)
                  DW_AT_data_member_location	(0x00)

0x00000d36:     DW_TAG_member
                  DW_AT_name	("Fn")
                  DW_AT_type	(0x00000e7f "builtin.Type.Fn")
                  DW_AT_alignment	(1)
                  DW_AT_data_member_location	(0x00)

0x00000d41:     DW_TAG_member
                  DW_AT_name	("Opaque")
                  DW_AT_type	(0x00000f1d "builtin.Type.Opaque")
                  DW_AT_alignment	(4)
                  DW_AT_data_member_location	(0x00)

0x00000d4c:     DW_TAG_member
                  DW_AT_name	("Frame")
                  DW_AT_type	(0x00000f30 "builtin.Type.Frame")
                  DW_AT_alignment	(4)
                  DW_AT_data_member_location	(0x00)

0x00000d57:     DW_TAG_member
                  DW_AT_name	("AnyFrame")
                  DW_AT_type	(0x00000f43 "builtin.Type.AnyFrame")
                  DW_AT_data_member_location	(0x00)

0x00000d61:     NULL

0x00000d62:   DW_TAG_structure_type
                DW_AT_name	("builtin.Type.Int")
                DW_AT_byte_size	(0x04)
                DW_AT_alignment	(2)

0x00000d69:     DW_TAG_member
                  DW_AT_name	("bits")
                  DW_AT_type	(0x00000794 "u16")
                  DW_AT_alignment	(2)
                  DW_AT_data_member_location	(0x00)

0x00000d74:     DW_TAG_member
                  DW_AT_name	("signedness")
                  DW_AT_type	(0x00000aed "builtin.Signedness")
                  DW_AT_alignment	(1)
                  DW_AT_data_member_location	(0x02)

0x00000d7f:     NULL

0x00000d80:   DW_TAG_structure_type
                DW_AT_name	("builtin.Type.Float")
                DW_AT_byte_size	(0x02)
                DW_AT_alignment	(2)

0x00000d87:     DW_TAG_member
                  DW_AT_name	("bits")
                  DW_AT_type	(0x00000794 "u16")
                  DW_AT_alignment	(2)
                  DW_AT_data_member_location	(0x00)

0x00000d92:     NULL

0x00000d93:   DW_TAG_structure_type
                DW_AT_name	("builtin.Type.Array")
                DW_AT_byte_size	(0x04)
                DW_AT_alignment	(4)

0x00000d9a:     DW_TAG_member
                  DW_AT_name	("sentinel")
                  DW_AT_type	(0x00000b79 "anyopaque *")
                  DW_AT_alignment	(4)
                  DW_AT_data_member_location	(0x00)

0x00000da5:     NULL

0x00000da6:   DW_TAG_structure_type
                DW_AT_name	("builtin.Type.Struct")
                DW_AT_byte_size	(0x0c)
                DW_AT_alignment	(4)

0x00000dad:     DW_TAG_member
                  DW_AT_name	("decls")
                  DW_AT_type	(0x00000dcf "[]builtin.Type.Declaration")
                  DW_AT_alignment	(4)
                  DW_AT_data_member_location	(0x00)

0x00000db8:     DW_TAG_member
                  DW_AT_name	("layout")
                  DW_AT_type	(0x00000c0b "builtin.Type::builtin.Type.ContainerLayout")
                  DW_AT_alignment	(1)
                  DW_AT_data_member_location	(0x08)

0x00000dc3:     DW_TAG_member
                  DW_AT_name	("is_tuple")
                  DW_AT_type	(0x0000030a "bool")
                  DW_AT_alignment	(1)
                  DW_AT_data_member_location	(0x09)

0x00000dce:     NULL

0x00000dcf:   DW_TAG_structure_type
                DW_AT_name	("[]builtin.Type.Declaration")
                DW_AT_byte_size	(0x08)
                DW_AT_alignment	(4)

0x00000dd6:     DW_TAG_member
                  DW_AT_name	("ptr")
                  DW_AT_type	(0x00000ded "builtin.Type.Declaration *")
                  DW_AT_alignment	(4)
                  DW_AT_data_member_location	(0x00)

0x00000de1:     DW_TAG_member
                  DW_AT_name	("len")
                  DW_AT_type	(0x000000c2 "usize")
                  DW_AT_alignment	(4)
                  DW_AT_data_member_location	(0x04)

0x00000dec:     NULL

0x00000ded:   DW_TAG_pointer_type
                DW_AT_type	(0x00000df6 "builtin.Type.Declaration")
                DW_AT_name	("*builtin.Type.Declaration")

0x00000df6:   DW_TAG_structure_type
                DW_AT_name	("builtin.Type.Declaration")
                DW_AT_byte_size	(0x08)
                DW_AT_alignment	(4)

0x00000dfd:     DW_TAG_member
                  DW_AT_name	("name")
                  DW_AT_type	(0x00000108 "[]u8")
                  DW_AT_alignment	(4)
                  DW_AT_data_member_location	(0x00)

0x00000e08:     NULL

0x00000e09:   DW_TAG_structure_type
                DW_AT_name	("[]builtin.Type.Error")
                DW_AT_byte_size	(0x08)
                DW_AT_alignment	(4)

0x00000e10:     DW_TAG_member
                  DW_AT_name	("ptr")
                  DW_AT_type	(0x00000e27 "builtin.Type.Error *")
                  DW_AT_alignment	(4)
                  DW_AT_data_member_location	(0x00)

0x00000e1b:     DW_TAG_member
                  DW_AT_name	("len")
                  DW_AT_type	(0x000000c2 "usize")
                  DW_AT_alignment	(4)
                  DW_AT_data_member_location	(0x04)

0x00000e26:     NULL

0x00000e27:   DW_TAG_pointer_type
                DW_AT_type	(0x00000e30 "builtin.Type.Error")
                DW_AT_name	("*builtin.Type.Error")

0x00000e30:   DW_TAG_structure_type
                DW_AT_name	("builtin.Type.Error")
                DW_AT_byte_size	(0x08)
                DW_AT_alignment	(4)

0x00000e37:     DW_TAG_member
                  DW_AT_name	("name")
                  DW_AT_type	(0x00000108 "[]u8")
                  DW_AT_alignment	(4)
                  DW_AT_data_member_location	(0x00)

0x00000e42:     NULL

0x00000e43:   DW_TAG_structure_type
                DW_AT_name	("builtin.Type.Enum")
                DW_AT_byte_size	(0x0c)
                DW_AT_alignment	(4)

0x00000e4a:     DW_TAG_member
                  DW_AT_name	("decls")
                  DW_AT_type	(0x00000dcf "[]builtin.Type.Declaration")
                  DW_AT_alignment	(4)
                  DW_AT_data_member_location	(0x00)

0x00000e55:     DW_TAG_member
                  DW_AT_name	("is_exhaustive")
                  DW_AT_type	(0x0000030a "bool")
                  DW_AT_alignment	(1)
                  DW_AT_data_member_location	(0x08)

0x00000e60:     NULL

0x00000e61:   DW_TAG_structure_type
                DW_AT_name	("builtin.Type.Union")
                DW_AT_byte_size	(0x0c)
                DW_AT_alignment	(4)

0x00000e68:     DW_TAG_member
                  DW_AT_name	("decls")
                  DW_AT_type	(0x00000dcf "[]builtin.Type.Declaration")
                  DW_AT_alignment	(4)
                  DW_AT_data_member_location	(0x00)

0x00000e73:     DW_TAG_member
                  DW_AT_name	("layout")
                  DW_AT_type	(0x00000c0b "builtin.Type::builtin.Type.ContainerLayout")
                  DW_AT_alignment	(1)
                  DW_AT_data_member_location	(0x08)

0x00000e7e:     NULL

0x00000e7f:   DW_TAG_structure_type
                DW_AT_name	("builtin.Type.Fn")
                DW_AT_byte_size	(0x03)
                DW_AT_alignment	(1)

0x00000e86:     DW_TAG_member
                  DW_AT_name	("calling_convention")
                  DW_AT_type	(0x00000ea8 "builtin.CallingConvention")
                  DW_AT_alignment	(1)
                  DW_AT_data_member_location	(0x00)

0x00000e91:     DW_TAG_member
                  DW_AT_name	("is_generic")
                  DW_AT_type	(0x0000030a "bool")
                  DW_AT_alignment	(1)
                  DW_AT_data_member_location	(0x01)

0x00000e9c:     DW_TAG_member
                  DW_AT_name	("is_var_args")
                  DW_AT_type	(0x0000030a "bool")
                  DW_AT_alignment	(1)
                  DW_AT_data_member_location	(0x02)

0x00000ea7:     NULL

0x00000ea8:   DW_TAG_enumeration_type
                DW_AT_type	(0x0000012f "u8")
                DW_AT_name	("builtin.CallingConvention")
                DW_AT_byte_size	(0x01)
                DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/builtin.zig")
                DW_AT_decl_line	(300)
                DW_AT_alignment	(1)

0x00000eb6:     DW_TAG_enumerator
                  DW_AT_name	("Unspecified")
                  DW_AT_const_value	(0)

0x00000ebc:     DW_TAG_enumerator
                  DW_AT_name	("C")
                  DW_AT_const_value	(1)

0x00000ec2:     DW_TAG_enumerator
                  DW_AT_name	("Naked")
                  DW_AT_const_value	(2)

0x00000ec8:     DW_TAG_enumerator
                  DW_AT_name	("Async")
                  DW_AT_const_value	(3)

0x00000ece:     DW_TAG_enumerator
                  DW_AT_name	("Inline")
                  DW_AT_const_value	(4)

0x00000ed4:     DW_TAG_enumerator
                  DW_AT_name	("Interrupt")
                  DW_AT_const_value	(5)

0x00000eda:     DW_TAG_enumerator
                  DW_AT_name	("Signal")
                  DW_AT_const_value	(6)

0x00000ee0:     DW_TAG_enumerator
                  DW_AT_name	("Stdcall")
                  DW_AT_const_value	(7)

0x00000ee6:     DW_TAG_enumerator
                  DW_AT_name	("Fastcall")
                  DW_AT_const_value	(8)

0x00000eec:     DW_TAG_enumerator
                  DW_AT_name	("Vectorcall")
                  DW_AT_const_value	(9)

0x00000ef2:     DW_TAG_enumerator
                  DW_AT_name	("Thiscall")
                  DW_AT_const_value	(10)

0x00000ef8:     DW_TAG_enumerator
                  DW_AT_name	("APCS")
                  DW_AT_const_value	(11)

0x00000efe:     DW_TAG_enumerator
                  DW_AT_name	("AAPCS")
                  DW_AT_const_value	(12)

0x00000f04:     DW_TAG_enumerator
                  DW_AT_name	("AAPCSVFP")
                  DW_AT_const_value	(13)

0x00000f0a:     DW_TAG_enumerator
                  DW_AT_name	("SysV")
                  DW_AT_const_value	(14)

0x00000f10:     DW_TAG_enumerator
                  DW_AT_name	("Win64")
                  DW_AT_const_value	(15)

0x00000f16:     DW_TAG_enumerator
                  DW_AT_name	("Kernel")
                  DW_AT_const_value	(16)

0x00000f1c:     NULL

0x00000f1d:   DW_TAG_structure_type
                DW_AT_name	("builtin.Type.Opaque")
                DW_AT_byte_size	(0x08)
                DW_AT_alignment	(4)

0x00000f24:     DW_TAG_member
                  DW_AT_name	("decls")
                  DW_AT_type	(0x00000dcf "[]builtin.Type.Declaration")
                  DW_AT_alignment	(4)
                  DW_AT_data_member_location	(0x00)

0x00000f2f:     NULL

0x00000f30:   DW_TAG_structure_type
                DW_AT_name	("builtin.Type.Frame")
                DW_AT_byte_size	(0x04)
                DW_AT_alignment	(4)

0x00000f37:     DW_TAG_member
                  DW_AT_name	("function")
                  DW_AT_type	(0x00000b79 "anyopaque *")
                  DW_AT_alignment	(4)
                  DW_AT_data_member_location	(0x00)

0x00000f42:     NULL

0x00000f43:   DW_TAG_structure_type
                DW_AT_name	("builtin.Type.AnyFrame")
                DW_AT_byte_size	(0x00)

0x00000f49:   DW_TAG_structure_type
                DW_AT_name	("fmt.Specifier")
                DW_AT_byte_size	(0x0c)
                DW_AT_alignment	(4)

0x00000f50:     DW_TAG_member
                  DW_AT_name	("payload")
                  DW_AT_type	(0x00000f88 "fmt.Specifier:Payload")
                  DW_AT_alignment	(4)
                  DW_AT_data_member_location	(0x00)

0x00000f5b:     DW_TAG_member
                  DW_AT_name	("tag")
                  DW_AT_type	(0x00000f66 "fmt.Specifier::@typeInfo(fmt.Specifier).Union.tag_type.?")
                  DW_AT_alignment	(1)
                  DW_AT_data_member_location	(0x08)

0x00000f66:     DW_TAG_enumeration_type
                  DW_AT_type	(0x00000341 "u2")
                  DW_AT_name	("@typeInfo(fmt.Specifier).Union.tag_type.?")
                  DW_AT_byte_size	(0x01)
                  DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/fmt.zig")
                  DW_AT_decl_line	(633)
                  DW_AT_alignment	(1)

0x00000f74:       DW_TAG_enumerator
                    DW_AT_name	("none")
                    DW_AT_const_value	(0)

0x00000f7a:       DW_TAG_enumerator
                    DW_AT_name	("number")
                    DW_AT_const_value	(1)

0x00000f80:       DW_TAG_enumerator
                    DW_AT_name	("named")
                    DW_AT_const_value	(2)

0x00000f86:       NULL

0x00000f87:     NULL

0x00000f88:   DW_TAG_union_type
                DW_AT_name	("fmt.Specifier:Payload")
                DW_AT_byte_size	(0x0c)
                DW_AT_alignment	(4)

0x00000f8f:     DW_TAG_member
                  DW_AT_name	("number")
                  DW_AT_type	(0x000000c2 "usize")
                  DW_AT_alignment	(4)
                  DW_AT_data_member_location	(0x00)

0x00000f9a:     DW_TAG_member
                  DW_AT_name	("named")
                  DW_AT_type	(0x00000108 "[]u8")
                  DW_AT_alignment	(4)
                  DW_AT_data_member_location	(0x00)

0x00000fa5:     NULL

0x00000fa6:   DW_TAG_enumeration_type
                DW_AT_type	(0x00000341 "u2")
                DW_AT_name	("fmt.Alignment")
                DW_AT_byte_size	(0x01)
                DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/fmt.zig")
                DW_AT_decl_line	(46)
                DW_AT_alignment	(1)

0x00000fb3:     DW_TAG_enumerator
                  DW_AT_name	("left")
                  DW_AT_const_value	(0)

0x00000fb9:     DW_TAG_enumerator
                  DW_AT_name	("center")
                  DW_AT_const_value	(1)

0x00000fbf:     DW_TAG_enumerator
                  DW_AT_name	("right")
                  DW_AT_const_value	(2)

0x00000fc5:     NULL

0x00000fc6:   DW_TAG_subprogram
                DW_AT_low_pc	(0x00000003)
                DW_AT_high_pc	(0x00000294)
                DW_AT_frame_base	(DW_OP_WASM_location 0x0 0x2, DW_OP_stack_value)
                DW_AT_linkage_name	("main")
                DW_AT_name	("main")
                DW_AT_decl_file	("/Users/antoine/prog/zig-playground/6-canvas/main.zig")
                DW_AT_decl_line	(87)
                DW_AT_type	(0x00001d09 "void")
                DW_AT_external	(true)

0x00000fe2:     DW_TAG_lexical_block
                  DW_AT_low_pc	(0x0000002a)
                  DW_AT_high_pc	(0x00000294)

0x00000feb:       DW_TAG_variable
                    DW_AT_location	(DW_OP_fbreg +8)
                    DW_AT_name	("result1")
                    DW_AT_decl_file	("/Users/antoine/prog/zig-playground/6-canvas/main.zig")
                    DW_AT_decl_line	(103)
                    DW_AT_type	(0x00001d17 "main.JSResult")

0x00000ff9:       DW_TAG_variable
                    DW_AT_location	(DW_OP_fbreg +40)
                    DW_AT_name	("result2")
                    DW_AT_decl_file	("/Users/antoine/prog/zig-playground/6-canvas/main.zig")
                    DW_AT_decl_line	(104)
                    DW_AT_type	(0x00001d17 "main.JSResult")

0x00001007:       DW_TAG_variable
                    DW_AT_location	(DW_OP_fbreg +72)
                    DW_AT_name	("message")
                    DW_AT_decl_file	("/Users/antoine/prog/zig-playground/6-canvas/main.zig")
                    DW_AT_decl_line	(119)
                    DW_AT_type	(0x00001d17 "main.JSResult")

0x00001016:       NULL

0x00001017:     NULL

0x00001018:   DW_TAG_subprogram
                DW_AT_low_pc	(0x00000296)
                DW_AT_high_pc	(0x00000436)
                DW_AT_frame_base	(DW_OP_WASM_location 0x0 0x4, DW_OP_stack_value)
                DW_AT_linkage_name	("main.sendToken__anon_832")
                DW_AT_name	("sendToken__anon_832")
                DW_AT_decl_file	("/Users/antoine/prog/zig-playground/6-canvas/main.zig")
                DW_AT_decl_line	(37)
                DW_AT_type	(0x00001d09 "void")

0x00001034:     DW_TAG_formal_parameter
                  DW_AT_location	(DW_OP_fbreg +0)
                  DW_AT_name	("message")
                  DW_AT_decl_file	("/Users/antoine/prog/zig-playground/6-canvas/main.zig")
                  DW_AT_decl_line	(37)
                  DW_AT_type	(0x00000108 "[]u8")

0x00001042:     NULL

0x00001043:   DW_TAG_subprogram
                DW_AT_low_pc	(0x00000437)
                DW_AT_high_pc	(0x0000048e)
                DW_AT_frame_base	(DW_OP_WASM_location 0x0 0x3, DW_OP_stack_value)
                DW_AT_linkage_name	("main.sendToken__anon_833")
                DW_AT_name	("sendToken__anon_833")
                DW_AT_decl_file	("/Users/antoine/prog/zig-playground/6-canvas/main.zig")
                DW_AT_decl_line	(37)
                DW_AT_type	(0x00001d09 "void")

0x0000105f:     DW_TAG_formal_parameter
                  DW_AT_location	(DW_OP_fbreg +15)
                  DW_AT_name	("message")
                  DW_AT_decl_file	("/Users/antoine/prog/zig-playground/6-canvas/main.zig")
                  DW_AT_decl_line	(37)
                  DW_AT_type	(0x0000012f "u8")

0x0000106d:     NULL

0x0000106e:   DW_TAG_subprogram
                DW_AT_low_pc	(0x00000490)
                DW_AT_high_pc	(0x00000784)
                DW_AT_frame_base	(DW_OP_WASM_location 0x0 0x3, DW_OP_stack_value)
                DW_AT_linkage_name	("main.closeExpressionAndGetResult")
                DW_AT_name	("closeExpressionAndGetResult")
                DW_AT_decl_file	("/Users/antoine/prog/zig-playground/6-canvas/main.zig")
                DW_AT_decl_line	(50)
                DW_AT_type	(0x00001d09 "void")

0x0000108a:     DW_TAG_lexical_block
                  DW_AT_low_pc	(0x000004be)
                  DW_AT_high_pc	(0x00000513)

0x00001093:       DW_TAG_variable
                    DW_AT_location	(DW_OP_fbreg +14)
                    DW_AT_name	("valueType")
                    DW_AT_decl_file	("/Users/antoine/prog/zig-playground/6-canvas/main.zig")
                    DW_AT_decl_line	(53)
                    DW_AT_type	(0x0000012f "u8")

0x000010a1:       NULL

0x000010a2:     DW_TAG_lexical_block
                  DW_AT_ranges	(0x00000000
                     [0x00000513, 0x0000058f)
                     [0x0000062d, 0x00000784))

0x000010a7:       DW_TAG_variable
                    DW_AT_location	(DW_OP_fbreg +15)
                    DW_AT_name	("len")
                    DW_AT_decl_file	("/Users/antoine/prog/zig-playground/6-canvas/main.zig")
                    DW_AT_decl_line	(56)
                    DW_AT_type	(0x0000012f "u8")

0x000010b5:       DW_TAG_variable
                    DW_AT_location	(DW_OP_fbreg +16)
                    DW_AT_name	("result")
                    DW_AT_decl_file	("/Users/antoine/prog/zig-playground/6-canvas/main.zig")
                    DW_AT_decl_line	(57)
                    DW_AT_type	(0x00001d17 "main.JSResult")

0x000010c3:       NULL

0x000010c4:     DW_TAG_lexical_block
                  DW_AT_low_pc	(0x00000590)
                  DW_AT_high_pc	(0x0000062c)

0x000010cd:       DW_TAG_variable
                    DW_AT_location	(DW_OP_fbreg +32)
                    DW_AT_name	("result")
                    DW_AT_decl_file	("/Users/antoine/prog/zig-playground/6-canvas/main.zig")
                    DW_AT_decl_line	(70)
                    DW_AT_type	(0x00001d17 "main.JSResult")

0x000010db:       NULL

0x000010dc:     NULL

0x000010dd:   DW_TAG_subprogram
                DW_AT_low_pc	(0x00000785)
                DW_AT_high_pc	(0x000007fa)
                DW_AT_frame_base	(DW_OP_WASM_location 0x0 0x4, DW_OP_stack_value)
                DW_AT_linkage_name	("main.debug__anon_839")
                DW_AT_name	("debug__anon_839")
                DW_AT_decl_file	("/Users/antoine/prog/zig-playground/6-canvas/main.zig")
                DW_AT_decl_line	(80)
                DW_AT_type	(0x00001d09 "void")

0x000010f9:     DW_TAG_formal_parameter
                  DW_AT_location	(DW_OP_fbreg +8)
                  DW_AT_name	("message")
                  DW_AT_decl_file	("/Users/antoine/prog/zig-playground/6-canvas/main.zig")
                  DW_AT_decl_line	(80)
                  DW_AT_type	(0x00000108 "[]u8")

0x00001107:     NULL

0x00001108:   DW_TAG_subprogram
                DW_AT_low_pc	(0x000007fb)
                DW_AT_high_pc	(0x00000809)
                DW_AT_frame_base	(DW_OP_WASM_location 0x3 0x0, DW_OP_stack_value)
                DW_AT_linkage_name	("main.JSResult.asInt")
                DW_AT_name	("asInt")
                DW_AT_decl_file	("/Users/antoine/prog/zig-playground/6-canvas/main.zig")
                DW_AT_decl_line	(32)
                DW_AT_type	(0x0000012f "u8")

0x00001127:     DW_TAG_formal_parameter
                  DW_AT_location	(DW_OP_WASM_location 0x0 0x0)
                  DW_AT_name	("self")
                  DW_AT_decl_file	("/Users/antoine/prog/zig-playground/6-canvas/main.zig")
                  DW_AT_decl_line	(32)
                  DW_AT_type	(0x00001d17 "main.JSResult")

0x00001136:     NULL

0x00001137:   DW_TAG_subprogram
                DW_AT_low_pc	(0x0000080a)
                DW_AT_high_pc	(0x0000086e)
                DW_AT_frame_base	(DW_OP_WASM_location 0x0 0x3, DW_OP_stack_value)
                DW_AT_linkage_name	("main.debug__anon_840")
                DW_AT_name	("debug__anon_840")
                DW_AT_decl_file	("/Users/antoine/prog/zig-playground/6-canvas/main.zig")
                DW_AT_decl_line	(80)
                DW_AT_type	(0x00001d09 "void")

0x00001153:     DW_TAG_formal_parameter
                  DW_AT_location	(DW_OP_fbreg +15)
                  DW_AT_name	("message")
                  DW_AT_decl_file	("/Users/antoine/prog/zig-playground/6-canvas/main.zig")
                  DW_AT_decl_line	(80)
                  DW_AT_type	(0x0000012f "u8")

0x00001161:     NULL

0x00001162:   DW_TAG_subprogram
                DW_AT_low_pc	(0x00000870)
                DW_AT_high_pc	(0x000008f0)
                DW_AT_frame_base	(DW_OP_WASM_location 0x0 0x4, DW_OP_stack_value)
                DW_AT_linkage_name	("builtin.panicStartGreaterThanEnd")
                DW_AT_name	("panicStartGreaterThanEnd")
                DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/builtin.zig")
                DW_AT_decl_line	(839)
                DW_AT_type	(0x00001d09 "void")
                DW_AT_noreturn	(true)

0x0000117f:     DW_TAG_formal_parameter
                  DW_AT_location	(DW_OP_fbreg +8)
                  DW_AT_name	("start")
                  DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/builtin.zig")
                  DW_AT_decl_line	(839)
                  DW_AT_type	(0x000000c2 "usize")

0x0000118e:     DW_TAG_formal_parameter
                  DW_AT_location	(DW_OP_fbreg +12)
                  DW_AT_name	("end")
                  DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/builtin.zig")
                  DW_AT_decl_line	(839)
                  DW_AT_type	(0x000000c2 "usize")

0x0000119d:     NULL

0x0000119e:   DW_TAG_subprogram
                DW_AT_low_pc	(0x000008f2)
                DW_AT_high_pc	(0x00000972)
                DW_AT_frame_base	(DW_OP_WASM_location 0x0 0x4, DW_OP_stack_value)
                DW_AT_linkage_name	("builtin.panicOutOfBounds")
                DW_AT_name	("panicOutOfBounds")
                DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/builtin.zig")
                DW_AT_decl_line	(834)
                DW_AT_type	(0x00001d09 "void")
                DW_AT_noreturn	(true)

0x000011bb:     DW_TAG_formal_parameter
                  DW_AT_location	(DW_OP_fbreg +8)
                  DW_AT_name	("index")
                  DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/builtin.zig")
                  DW_AT_decl_line	(834)
                  DW_AT_type	(0x000000c2 "usize")

0x000011ca:     DW_TAG_formal_parameter
                  DW_AT_location	(DW_OP_fbreg +12)
                  DW_AT_name	("len")
                  DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/builtin.zig")
                  DW_AT_decl_line	(834)
                  DW_AT_type	(0x000000c2 "usize")

0x000011d9:     NULL

0x000011da:   DW_TAG_subprogram
                DW_AT_low_pc	(0x00000974)
                DW_AT_high_pc	(0x00000b66)
                DW_AT_frame_base	(DW_OP_WASM_location 0x0 0x6, DW_OP_stack_value)
                DW_AT_linkage_name	("mem.copyForwards__anon_1107")
                DW_AT_name	("copyForwards__anon_1107")
                DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/mem.zig")
                DW_AT_decl_line	(202)
                DW_AT_type	(0x00001d09 "void")

0x000011f6:     DW_TAG_formal_parameter
                  DW_AT_location	(DW_OP_fbreg +8)
                  DW_AT_name	("dest")
                  DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/mem.zig")
                  DW_AT_decl_line	(202)
                  DW_AT_type	(0x00000108 "[]u8")

0x00001204:     DW_TAG_formal_parameter
                  DW_AT_location	(DW_OP_fbreg +16)
                  DW_AT_name	("source")
                  DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/mem.zig")
                  DW_AT_decl_line	(202)
                  DW_AT_type	(0x00000108 "[]u8")

0x00001212:     DW_TAG_lexical_block
                  DW_AT_low_pc	(0x00000b2e)
                  DW_AT_high_pc	(0x00000b66)

0x0000121b:       DW_TAG_variable
                    DW_AT_location	(DW_OP_fbreg +40)
                    DW_AT_name	("d")
                    DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/mem.zig")
                    DW_AT_decl_line	(203)
                    DW_AT_type	(0x00000126 "u8 *")

0x00001229:       DW_TAG_variable
                    DW_AT_location	(DW_OP_fbreg +47)
                    DW_AT_name	("s")
                    DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/mem.zig")
                    DW_AT_decl_line	(203)
                    DW_AT_type	(0x0000012f "u8")

0x00001237:       NULL

0x00001238:     NULL

0x00001239:   DW_TAG_subprogram
                DW_AT_low_pc	(0x00000b67)
                DW_AT_high_pc	(0x00000ba1)
                DW_AT_frame_base	(DW_OP_WASM_location 0x0 0x6, DW_OP_stack_value)
                DW_AT_linkage_name	("builtin.default_panic")
                DW_AT_name	("default_panic")
                DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/builtin.zig")
                DW_AT_decl_line	(733)
                DW_AT_type	(0x00001d09 "void")
                DW_AT_noreturn	(true)

0x00001256:     DW_TAG_formal_parameter
                  DW_AT_location	(DW_OP_fbreg +0)
                  DW_AT_name	("msg")
                  DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/builtin.zig")
                  DW_AT_decl_line	(733)
                  DW_AT_type	(0x00000108 "[]u8")

0x00001265:     DW_TAG_formal_parameter
                  DW_AT_location	(DW_OP_fbreg +12)
                  DW_AT_name	("error_return_trace")
                  DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/builtin.zig")
                  DW_AT_decl_line	(733)
                  DW_AT_type	(0x00001d40 "builtin.StackTrace *")

0x00001274:     DW_TAG_formal_parameter
                  DW_AT_location	(DW_OP_WASM_location 0x0 0x3)
                  DW_AT_name	("ret_addr")
                  DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/builtin.zig")
                  DW_AT_decl_line	(733)
                  DW_AT_type	(0x00001d8e "?usize")

0x00001284:     NULL

0x00001285:   DW_TAG_subprogram
                DW_AT_low_pc	(0x00000ba3)
                DW_AT_high_pc	(0x00000e16)
                DW_AT_frame_base	(DW_OP_WASM_location 0x0 0x5, DW_OP_stack_value)
                DW_AT_linkage_name	("debug.panicExtra__anon_1239")
                DW_AT_name	("panicExtra__anon_1239")
                DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/debug.zig")
                DW_AT_decl_line	(354)
                DW_AT_type	(0x00001d09 "void")
                DW_AT_noreturn	(true)

0x000012a2:     DW_TAG_formal_parameter
                  DW_AT_location	(DW_OP_fbreg +8)
                  DW_AT_name	("trace")
                  DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/debug.zig")
                  DW_AT_decl_line	(359)
                  DW_AT_type	(0x00001d40 "builtin.StackTrace *")

0x000012b1:     DW_TAG_formal_parameter
                  DW_AT_location	(DW_OP_WASM_location 0x0 0x1)
                  DW_AT_name	("ret_addr")
                  DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/debug.zig")
                  DW_AT_decl_line	(359)
                  DW_AT_type	(0x00001d8e "?usize")

0x000012c1:     DW_TAG_formal_parameter
                  DW_AT_location	(DW_OP_WASM_location 0x0 0x2)
                  DW_AT_name	("args")
                  DW_AT_decl_file	("/opt/homebrew/Cellar/zig/0.11.0/lib/zig/std/debug.zig")
                  DW_AT_decl_line	(359)
                  DW_AT_type	(0x00001dc2 "struct{usize, usize}")

0x000012d1:     DW_TAG_lexical_block
                  DW_AT_low_pc	(0x00000bcd)
                  DW_AT_high_pc	(0x00000e16)

